{
  "intents": [
    {
      "tag": "ar-formal-welcome",
      "patterns": ["احتاجك في خدمة", "كيف حالك", "مرحبا"],
      "responses": [
        "كيف استطيع مساعدتك",
        "مرحبا بك كيف اخدمك"
      ]
    },
    {
      "tag": "ar-formal-Depression",
      "patterns": [
        "- الشعور المستمر بالحزن أو اليأس أو الفراغ",
        "فقدان الاهتمام أو المتعة بالأنشطة التي استمتعت بها في السابق",
        "تغيرات في الشهية والوزن (إما بالزيادة أو النقصان)",
        "التعب أو فقدان الطاقة"
      ],
      "responses": [
        "أعتقد أنك تعاني من الاكتئاب ويجب عليك التحدث عن العلاج أو الاستشارة فهو علاج فعال للاكتئاب. يمكن استخدام أنواع مختلفة من العلاج مثل العلاج السلوكي المعرفي . والعلاج بين الأشخاص والعلاج النفسي الديناميكي. تساعد هذه العلاجات الأفراد على تحديد أنماط التفكير السلبي وتغييرها",
        "\"لقد كنت مصابًا بالاكتئاب، أعتقد أن العلاج بالكلام أو الاستشارة هو علاج فعال للاكتئاب. يمكن استخدام أنواع مختلفة من العلاج، مثل العلاج السلوكي المعرفي  والعلاج بين الأشخاص ، والعلاج النفسي الديناميكي. تساعد هذه العلاجات الأفراد على تحديد أنماط التفكير السلبي وتغييرها، وتطوير مهارات التأقلم، وتحسين العلاقات. وأنواع أخرى من مضادات الاكتئاب شائعة الاستخدام. من المهم ملاحظة أنه يجب وصف الدواء ومراقبته من قبل أخصائي الرعاية الصحية. تغييرات نمط الحياة: الانخراط في عادات صحية يمكن أن يكمل علاجات أخرى للاكتئاب. ممارسة التمارين الرياضية بانتظام، والحفاظ على نظام غذائي متوازن، الحصول على قسط كافٍ من النوم، وتجنب تعاطي الكحول أو المخدرات يمكن أن يكون له تأثير إيجابي على الحالة المزاجية والرفاهية العامة. شبكة الدعم: يعد بناء شبكة دعم قوية أمرًا ضروريًا. إن إحاطة نفسك بأصدقاء أو عائلة متفهمين وداعمين أو الانضمام إلى مجموعات الدعم يمكن أن يوفر الدعم العاطفي ويساعد في تقليل مشاعر العزلة "
      ]
    },
    {
      "tag": "ar-welcome",
      "patterns": ["اهلا", "هاي", "اشطا", "فينك", "و حكايتك اي ياللي", "صبح"],
      "responses": [
        "اهلا  انا موجود هنا عشان اساعدك",
        "اساعدك ازاي",
        "اي الاخبار"
      ]
    },
    {
      "tag": "ar-argue",
      "patterns": ["عاوزك في حوار", "بقولك اي", "عاوزك في مصلحة"],
      "responses": ["يعم سيبني في حالي", "مش وقتك والله", "مش فاضي والله يخويا"]
    },
    {
      "tag": "ar-amr",
      "patterns": [
        "تملي معاك",
        "أنا عايش و مش عايش و مش قادر علي بعدك",
        "و بينا ميعاد",
        "أمنتك يا حبيبي امانة",
        "راجع بتقول اللي ما بينا و بتسال لي مكملناش "
      ],
      "responses": ["يمزاجك يا زعيم اموت انا في عمرو دياب"]
    },
    {
      "tag": "ar-amr",
      "patterns": [
        "تملي معاك",
        "أنا عايش و مش عايش و مش قادر علي بعدك",
        "و بينا ميعاد",
        "أمنتك يا حبيبي امانة",
        "راجع بتقول اللي ما بينا و بتسال لي مكملناش "
      ],
      "responses": ["يمزاجك يا زعيم اموت انا في عمرو دياب"]
    },
    {
      "tag" : "hb-dogs",
      "patterns" : [
        "שלום! איך אתה מרגיש היום?"
       ,"אני אוהב ללמוד עברית חדשה.",
        "האוכל העברי טעים מאוד!"
      ],
        "responses": ["https://youtube.com/clip/UgkxdZGqjA7lvXme1DT2ZLRPT7Xok6BUf9zI?si=_hUP174TIxwbXVno"]
    },
    {
      "tag": "greeting",
      "patterns": [
        "Hi there",
        "How are you",
        "Is anyone there?",
        "Hey",
        "Hola",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hello",
        "nice To meet you",
        "I Was Waiting you",
        "Good to see you again",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "Nice chatting to you, bye",
        "Till next time"
      ],
      "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Awesome, thanks",
        "Thanks for helping me"
      ],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "noanswer",
      "patterns": [],
      "responses": [
        "Sorry, can't understand you",
        "Please give me more info",
        "Not sure I understand"
      ]
    },
    {
      "tag": "options",
      "patterns": [
        "How you could help me?",
        "What you can do?",
        "What help you provide?",
        "How you can be helpful?",
        "What support is offered"
      ],
      "responses": [
        "I can guide you through Adverse drug reaction list, Blood pressure tracking, Hospitals and Pharmacies",
        "Offering support for Adverse drug reaction, Blood pressure, Hospitals and Pharmacies"
      ]
    },
    {
      "tag": "Depression",
      "patterns": [
        "Persistent feelings of sadness, hopelessness, or emptiness",
        "Loss of interest or pleasure in activities once enjoyed",
        "Changes in appetite and weight (either increase or decrease)",
        "Fatigue or loss of energy",
        "Difficulty concentrating, making decisions, or remembering",
        "Sleep disturbances (insomnia or excessive sleep)",
        "Feelings of worthlessness or excessive guilt",
        "Thoughts of death or suicide"
      ],
      "responses": [
        "Oh no your symptoms seem to 'Depression' illness Here My Recommended Treatment  Psychotherapy: Psychotherapy, also known as talk therapy or counseling, is an effective treatment for depression. Different types of therapy, such as cognitive-behavioral therapy (CBT), interpersonal therapy (IPT), and psychodynamic therapy, may be utilized. These therapies help individuals identify and change negative thought patterns, develop coping skills, and improve relationships.Medication: Antidepressant medications may be prescribed by a psychiatrist or a primary care physician. Selective serotonin reuptake inhibitors (SSRIs), serotonin-norepinephrine reuptake inhibitors (SNRIs), and other types of antidepressants are commonly used. It's important to note that medication should be prescribed and monitored by a healthcare professional.Lifestyle changes: Engaging in healthy habits can complement other treatments for depression. Regular exercise, maintaining a balanced diet, getting enough sleep, and avoiding alcohol or drug abuse can have a positive impact on mood and overall well-being.Support network: Building a strong support network is essential. Surrounding yourself with understanding and supportive friends, family, or joining support groups can provide emotional support and help reduce feelings of isolation.Self-care: Engaging in self-care activities that you enjoy can help improve your mood. This may include hobbies, relaxation techniques (such as deep breathing, meditation, or mindfulness exercises), practicing good hygiene, and setting aside time for activities that promote self-care.It's important to consult with a healthcare professional, such as a psychiatrist or psychologist, to receive a thorough evaluation and personalized recommendations for the treatment of depression. Treatment plans can vary depending on the severity of the depression and individual needs.",
        "I think you had a 'Depression'  you should talk therapy or counseling, is an effective treatment for depression. Different types of therapy, such as cognitive-behavioral therapy (CBT), interpersonal therapy (IPT), and psychodynamic therapy, may be utilized. These therapies help individuals identify and change negative thought patterns, develop coping skills, and improve relationships.",
        "you had a 'Depression' , i think talking  therapy or counseling, is an effective treatment for depression. Different types of therapy, such as cognitive-behavioral therapy (CBT), interpersonal therapy (IPT), and psychodynamic therapy, may be utilized. These therapies help individuals identify and change negative thought patterns, develop coping skills, and improve relationships.Medication: Antidepressant medications may be prescribed by a psychiatrist or a primary care physician. Selective serotonin reuptake inhibitors (SSRIs), serotonin-norepinephrine reuptake inhibitors (SNRIs), and other types of antidepressants are commonly used. It's important to note that medication should be prescribed and monitored by a healthcare professional.Lifestyle changes: Engaging in healthy habits can complement other treatments for depression. Regular exercise, maintaining a balanced diet, getting enough sleep, and avoiding alcohol or drug abuse can have a positive impact on mood and overall well-being.Support network: Building a strong support network is essential. Surrounding yourself with understanding and supportive friends, family, or joining support groups can provide emotional support and help reduce feelings of isolation "
      ]
    },
    {
      "tag": "ADHD",
      "patterns": [
        "Inattention and difficulty sustaining focus on tasks",
        "Hyperactivity or excessive restlessness (in children)",
        "Impulsivity and difficulty with self-control",
        "Forgetfulness and disorganization",
        "Difficulty completing tasks or following instructions",
        "Fidgeting or squirming",
        "Talking excessively or interrupting others"
      ],
      "responses": [
        "your symptoms seem to you had Attention-Deficit/Hyperactivity Disorder (ADHD) i will give you some solutions [1] Medication: Stimulant medications, such as methylphenidate (Ritalin) or amphetamines (Adderall), are commonly prescribed to manage ADHD symptoms. These medications help improve focus, attention, and impulse control. Non-stimulant medications, such as atomoxetine (Strattera) or bupropion (Wellbutrin), may be used as alternatives or in combination with stimulants.[2] Behavioral Therapy: Behavioral therapy, particularly behavioral parent training and behavioral classroom interventions, is an effective treatment approach for children and adolescents with ADHD. It focuses on teaching parents, teachers, and individuals with ADHD specific strategies to manage behaviors, improve organizational skills, and promote positive reinforcement. [3] Education and Skill-building: Psychoeducation is an essential component of ADHD treatment. Learning about ADHD, its symptoms, and its impact can help individuals and their families understand the condition better. Skill-building programs, such as social skills training or organizational skills training, can also be beneficial in improving daily functioning. Supportive Interventions: Creating a supportive environment is crucial for individuals with ADHD. This may involve working closely with teachers, implementing accommodations at school or work, and providing structure and routines at home. [4] Supportive interventions can help individuals manage their symptoms and succeed in various aspects of life. [5] Coaching and Counseling: ADHD coaching and counseling can be valuable for individuals struggling with ADHD-related challenges. Coaches and counselors can provide guidance, support, and strategies to improve time management, organization, goal-setting, and emotional regulation. [6] Lifestyle Adjustments: Developing healthy lifestyle habits can complement other treatments for ADHD. Regular exercise, maintaining a balanced diet, ensuring adequate sleep, and minimizing distractions in the environment can help manage symptoms. NOTE !! It's important to consult with a healthcare professional, such as a psychiatrist or psychologist specializing in ADHD, to receive a comprehensive evaluation and personalized treatment recommendations. The treatment plan may be adjusted over time based on individual needs and response to interventions"
      ]
    },
    {
      "tag": "Panic Disorder",
      "patterns": [
        "Recurrent panic attacks (sudden intense periods of fear or discomfort)",
        "Palpitations, rapid heart rate, or pounding heart",
        "Sweating, trembling, or shaking",
        "Shortness of breath or feeling smothered",
        "Chest pain or discomfort",
        "Fear of losing control or going crazy",
        "Avoidance of situations associated with panic attacks"
      ],
      "responses": [
        "i think you have Panic Disorder i will give you some recommneds [1] Cognitive-Behavioral Therapy (CBT): CBT is often considered the first-line treatment for Panic Disorder. It focuses on identifying and changing negative thought patterns and behaviors that contribute to panic attacks. Cognitive restructuring helps individuals challenge and modify irrational thoughts and beliefs, while exposure therapy gradually exposes them to feared situations or bodily sensations associated with panic attacks to reduce anxiety and desensitize the fear response.[2] Medication: Antidepressants, particularly selective serotonin reuptake inhibitors (SSRIs) and serotonin-norepinephrine reuptake inhibitors (SNRIs), are commonly prescribed for Panic Disorder. These medications help regulate brain chemistry and reduce the frequency and intensity of panic attacks. Benzodiazepines may be used on a short-term basis for immediate relief during severe panic episodes, but they are generally not recommended for long-term use due to the risk of dependence.[3] Relaxation Techniques: Learning and practicing relaxation techniques, such as deep breathing exercises, progressive muscle relaxation, and mindfulness meditation, can help individuals manage anxiety and reduce the intensity of panic symptoms. These techniques promote relaxation and can be used during panic attacks to help regain a sense of calm.[4] Lifestyle Modifications: Making certain lifestyle changes can support the management of Panic Disorder. This includes maintaining a regular sleep schedule, engaging in regular physical exercise, avoiding excessive caffeine and stimulants, and adopting stress-reducing practices such as engaging in hobbies, spending time with loved ones, and seeking social support.[5] Supportive Therapies: Supportive therapies, such as group therapy or support groups, can provide individuals with Panic Disorder an opportunity to connect with others who have similar experiences. Sharing experiences, coping strategies, and receiving support from others can help reduce feelings of isolation and provide a sense of community"
      ]
    },
    {
      "tag": "OCD",
      "patterns": [
        "Recurrent, intrusive, and unwanted thoughts, images, or urges (obsessions)",
        "Repetitive behaviors or mental acts performed to alleviate anxiety caused by obsessions (compulsions)",
        "Fear of contamination or excessive concern with cleanliness",
        "Need for symmetry or exactness",
        "Doubts about performing tasks correctly or fear of harm to oneself or others",
        "Spending significant time on obsessive thoughts and compulsive behaviors, interfering with daily life"
      ],
      "responses": [
        "you had Obsessive-compulsive disorder (OCD) is a mental health condition that can be treated1. The treatment recommended will depend on how much it's affecting your life2. The two main treatments for OCD are psychotherapy and medications32. [1] Psychotherapy Cognitive behavioral therapy (CBT), a type of psychotherapy, is effective for many people with OCD32.Exposure and response prevention (ERP), a component of CBT therapy, involves gradually exposing you to a feared object or obsession, such as dirt, and having you learn ways to resist the urge to do your compulsive rituals3.Therapy for OCD usually involves working with your therapist to break down your problems into their separate parts, such as your thoughts, physical feelings and actions2. [2] Medications Certain psychiatric medications can help control the obsessions and compulsions of OCD. Most commonly, antidepressants are tried first3.Antidepressants approved by the U.S. Food and Drug Administration (FDA) to treat OCD include: Clomipramine (Anafranil), Fluoxetine (Prozac), Fluvoxamine, Paroxetine (Paxil, Pexeva), and Sertraline (Zoloft)3.The main medicines prescribed are a type of antidepressant called selective serotonin reuptake inhibitors (SSRIs). An SSRI can help improve OCD symptoms by increasing the levels of a chemical called serotonin in your brain2.Depending on the severity of OCD, some people may need long-term, ongoing or more intensive treatment3. These treatments can be very effective, but it's important to be aware that it can take several months before you notice the benefit2. It's always best to consult with a healthcare professional for personalized advice."
      ]
    },
    {
      "tag": "PTSD",
      "patterns": [
        "Intrusive and distressing memories or flashbacks of a traumatic event",
        "Nightmares related to the traumatic event",
        "Avoidance of reminders or triggers associated with the trauma",
        "Negative changes in mood and thinking patterns",
        "Hypervigilance and exaggerated startle response",
        "Difficulty sleeping and concentrating",
        "Irritability or outbursts of anger"
      ],
      "responses": [
        "By thinking you had Post-traumatic stress disorder (PTSD) .Post-traumatic stress disorder (PTSD) is a mental health condition that can be treated. The primary treatment is psychotherapy, but can also include medication. [1] Psychotherapy => Cognitive behavioral therapy (CBT), a type of psychotherapy, is effective for many people with OCD.Exposure and response prevention (ERP), a component of CBT therapy, involves gradually exposing you to a feared object or obsession, such as dirt, and having you learn ways to resist the urge to do your compulsive rituals3.Therapy for OCD usually involves working with your therapist to break down your problems into their separate parts, such as your thoughts, physical feelings and actions. , [2] Medications => Certain psychiatric medications can help control the obsessions and compulsions of OCD. Most commonly, antidepressants are tried first .Antidepressants approved by the U.S. Food and Drug Administration (FDA) to treat OCD include: Clomipramine (Anafranil), Fluoxetine (Prozac), Fluvoxamine, Paroxetine (Paxil, Pexeva), and Sertraline (Zoloft).The main medicines prescribed are a type of antidepressant called selective serotonin reuptake inhibitors (SSRIs). An SSRI can help improve OCD symptoms by increasing the levels of a chemical called serotonin in your brain.Depending on the severity of OCD, some people may need long-term, ongoing or more intensive treatment3. These treatments can be very effective, but it's important to be aware that it can take several months before you notice the benefit. It's always best to consult with a healthcare professional for personalized advice. and it's better to know that Cognitive behavioral therapy (CBT) helps you recognize the ways of thinking (cognitive patterns) that are keeping you stuck.Exposure therapy helps you safely face both situations and memories that you find frightening so that you can learn to cope with them effectively.Eye movement desensitization and reprocessing (EMDR) combines exposure therapy with a series of guided eye movements that help you process traumatic memories and change how you react to them "
      ]
    },
    {
      "tag": "Schizophrenia",
      "patterns": [
        "Delusions (false beliefs) and hallucinations (seeing or hearing things that aren't there)",
        "Disorganized thinking and speech patterns",
        "Lack of motivation and reduced emotional expression",
        "Social withdrawal and difficulty in maintaining relationships",
        "Impaired cognitive abilities, such as memory and attention"
      ],
      "responses": [
        "By thinking you had Schizophrenia , and Schizophrenia is a complex mental health condition that requires lifelong treatment, even when symptoms have subsided. The treatment typically includes a few elements: [1] Medications => Antipsychotic drugs are the cornerstone of schizophrenia treatment. They are thought to control symptoms by affecting the brain neurotransmitter dopamine ,The goal of treatment with antipsychotic medications is to effectively manage signs and symptoms at the lowest possible dose. The psychiatrist may try different drugs, different doses or combinations over time to achieve the desired result1. Other medications also may help, such as antidepressants or anti-anxiety drugs. [2] Psychotherapy => Many types of therapy will reduce symptoms, relieve stress, and teach self-care methods. Where needed, therapy can also improve social and work skills. [3]Self-care => This involves learning to manage your symptoms, reduce stress, and improve your overall quality of life.\nIt's important to note that while the causes of schizophrenia aren't yet understood, and there's no cure for schizophrenia, treatment can greatly improve symptoms and reduce the likelihood of them coming back. Treatment is usually guided by a psychiatrist experienced in treating schizophrenia and may also include a psychologist, social worker, psychiatric nurse and possibly a case manager to coordinate care.\n"
      ]
    }
  ]
}
