{
  "intents": [
    {
      "tag": "depressed",
      "patterns": [
        "I can't take it anymore",
        "I am so depressed",
        "I think i'm depressed.",
        "I have depression"
      ],
      "responses": [
        "It helps to talk about what's happening. You're going to be okay",
        "Talk to me. Tell me more. It helps if you open up yourself to someone else.",
        "Sometimes when we are depressed, it is hard to care about anything. It can be hard to do the simplest of things. Give yourself time to heal."
      ]
    },
    {
      "tag": "fact-3",
      "patterns": ["What is Depression?", "Define Depression"],
      "responses": [
        "A mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life."
      ]
    },
    {
      "tag": "fact-5",
      "patterns": [
        "How do i know if i have Depression?",
        "Am i depressed?",
        "Am i suffering from depression?",
        "Am i mentally ill?"
      ],
      "responses": [
        "For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks. Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day."
      ]
    },
    {
      "tag": "ar-depressed",
      "patterns": [
        "لا أستطيع التحمل أكثر من ذلك",
        "أشعر باكتئاب حاد",
        "أعتقد أنني مكتئب",
        "أشعر بالاكتئاب"
      ],
      "responses": [
        "التحدث عن أحوالك يساعد كثيرا.ستكون بخير",
        "تحدث الي.أخبرني المزيد.الانفتاح للتحدث الي شخص أخر يمكنه مساعدتك",
        "في بعض الأحيان عندما نشعر بالاكتئاب، يصعب علينا الاهتمام بأي شيء. قد يكون من الصعب القيام بأبسط الأشياء. اعط لنفسك وقتا لتتعافي."
      ]
    },
    {
      "tag": "ar-fact-3",
      "patterns": ["ما هو الاكتئاب؟", "عرف الاكتئاب"],
      "responses": [
        "اضطراب في الصحة العقلية يتميز بمزاج مكتئب بشكل مستمر أو فقدان الاهتمام بالأنشطة، مما يسبب ضعفًا كبيرًا في الحياة اليومية."
      ]
    },
    {
      "tag": "ar-fact-5",
      "patterns": [
        "كيف أعرف إذا كنت مصابًا بالاكتئاب؟",
        "هل أنا مصاب بالاكتئاب؟",
        "هل أعاني من الاكتئاب؟",
        "هل أنا مريض عقليا؟"
      ],
      "responses": [
        "لتشخيص الاكتئاب، يجب أن يعاني الشخص من انخفاض الحالة المزاجية أو فقدان الاهتمام أو المتعة في الحياة لمدة أسبوعين على الأقل. كما أنهم قد يعانون من الأعراض التالية: مشاعر الحزن أو اليأس أو التهيج كل يوم تقريبًا."
      ]
    },
    {
      "tag": "ar-fact-5",
      "patterns": [
        "ما هو العلاج؟",
        "ما هو علاج ",
        "العلاج و الشفاء منه؟",
        "ماذا تقترح ؟"
      ],
      "responses": [
        "يمكن أن يكون العلاج السلوكي المعرفي (CBT)، أو العلاج النفسي، أو الأساليب العلاجية الأخرى فعالاً في مساعدة الأفراد على فهم وإدارة أفكارهم وعواطفهم وسلوكياتهم.",
        "استشر أخصائي الصحة العقلية مثل طبيب نفساني أو طبيب نفسي أو معالج نفسي. يمكنهم تقديم التشخيص المناسب والتوصية بخطة العلاج المناسبة."
      ]
    }
  ]
}
