[
  {
    "tag": "ar-fact-331",
    "patterns": ["احتاج المساعدة"],
    "responses": [
      "بالطبع، يمكنني ان اقدم لك الدعم والمساعدة النفسية. انا هنا للاستماع إليك، وتقديم النصائح بناءً على المعلومات التي تشاركها معي، ومساعدتك في التعامل مع مشاكلك او مخاوفك. إذا كنت تواجه مشكلة معينة او تحتاج إلى نصيحة في موضوع معين، لا تتردد في إخباري."
    ]
  },
  {
    "tag": "ar-fact-332",
    "patterns": ["اشعر بالتوتر دائما"],
    "responses": [
      "اشعر بالاسف لسماع انك تعاني من التوتر المستمر. هناك عدة طرق يمكن ان تساعدك في التعامل مع التوتر: جرب التنفس بعمق من خلال الانف لمدة اربع ثوانٍ، واحتفظ بالنفس لمدة اربع ثوانٍ، ثم اطلقه ببطء من خلال الفم لمدة اربع ثوانٍ ، ممارسة الرياضة حتى المشي البسيط لمدة 30 دقيقة يمكن ان يساعد في تحسين مزاجك، تاكد من انك تحصل على قدر كافٍ من النوم الجيد حيث ان قلة النوم يمكن ان تزيد من مستويات التوتر، إدارة الوقت بفعالية يمكن ان يقلل من الشعور بالضغط والتوتر. حاول تحديد اولوياتك وإنجاز المهام الاكثر اهمية اولاً، حاول تجنب الكافيين، النيكوتين، والكحول، حيث يمكن ان تزيد من مستويات التوتر."
    ]
  },
  {
    "tag": "ar-fact-333",
    "patterns": ["اشعر بالخوف من المستقبل"],
    "responses": [
      "الشعور بالخوف من المستقبل هو امر شائع يواجهه الكثير من الناس. إليك بعض النصائح التي قد تساعدك في التعامل مع هذا الخوف: حاول التركيز على الحاضر بدلاً من القلق بشان المستقبل، تحديد اهداف واضحة وقابلة للتحقيق يمكن ان يساعدك في الشعور بمزيد من السيطرة على مستقبلك، قم بتجزئة اهدافك إلى خطوات صغيرة وقابلة للإدارة، من الجيد ان تخطط لمستقبلك، ولكن كن مرناً وقابلاً للتكيف مع التغيرات التي قد تحدث، حاول التركيز على الجوانب الإيجابية في حياتك وتذكر ان الخوف من المستقبل لا يعني بالضرورة حدوث شيء سيء."
    ]
  },
  {
    "tag": "ar-fact-334",
    "patterns": ["لدي فقدان للشهية"],
    "responses": [
      "فقدان الشهية يمكن ان يكون نتيجة لعدة عوامل نفسية او جسدية، مثل التوتر، القلق، الاكتئاب، او مشاكل صحية جسدية. من المهم ان تتعامل مع هذا الامر بجدية لان التغذية السليمة ضرورية لصحتك العامة. هنا بعض النصائح التي قد تساعدك: تناول وجبات صغيرة ومتكررة بدلاً من محاولة تناول ثلاث وجبات كبيرة في اليوم، هذا يمكن ان يجعل تناول الطعام اكثر سهولة، تناول الاطعمة التي تستمتع بها بشكل خاص يمكن ان يساعد في زيادة شهيتك، حاول تجربة اطعمة جديدة او العودة إلى الاطعمة التي كنت تحبها سابقًا حتى إذا كانت شهيتك منخفضة، حاول التاكد من ان ما تاكله يحتوي على العناصر الغذائية التي تحتاجها، يمكن ان يساعد شرب العصائر او المشروبات الغنية بالعناصر الغذائية على الحصول على بعض الفيتامينات والمعادن الضرورية إذا كنت تجد صعوبة في تناول الطعام الصلب."
    ]
  },
  {
    "tag": "ar-fact-335",
    "patterns": [
      "اشعر بفقدان للشغف",
      "شعر بالصعوبة في اداء مهامي اليومية العادية"
    ],
    "responses": [
      "الشعور بفقدان الشغف والصعوبة في اداء المهام اليومية يمكن ان يكونا علامات على الاكتئاب او القلق او الإرهاق. من المهم التعامل مع هذه المشاعر بجدية لانها يمكن ان تؤثر بشكل كبير على حياتك اليومية وصحتك العامة. إليك بعض الخطوات التي قد تساعدك في التعامل مع هذه الحالة: حاول التفكير في الاسباب المحتملة لفقدان الشغف. هل هناك شيء معين يسبب لك التوتر او القلق؟ هل هناك تغيرات كبيرة في حياتك؟، حدد اهدافًا صغيرة يمكن تحقيقها بسهولةبدلاً من محاولة إنجاز الكثير من المهام الكبيرة. هذا يمكن ان يساعدك في بناء الثقة والعودة إلى مسار الإنتاجية تدريجيًا، حاول إعادة إشعال شغفك بالانشطة التي كنت تستمتع بها سابقًا. حتى لو لم تشعر بالشغف الفوري، قد يساعدك العودة إلى هذه الانشطة في تحفيز مشاعرك الإيجابية، حاول إيجاد توازن بين العمل والانشطة الترفيهية. الراحة والوقت لنفسك ضروريان لتجنب الإرهاق."
    ]
  },
  {
    "tag": "ar-fact-336",
    "patterns": ["اغسل يدي بشكل متكرر و دائما ما اخاف من فقدان شخص عزيز"],
    "responses": [
      "غسل اليدين بشكل متكرر والخوف المستمر من فقدان شخص عزيز يمكن ان يكونان اعراضًا للقلق او اضطراب الوسواس القهري (OCD). يمكن ان تكون هذه الاعراض مزعجة وتؤثر على جودة حياتك. إليك بعض النصائح للتعامل مع هذه الحالة: حاول تحديد اوقات محددة لغسل اليدين، والالتزام بها يمكن ان يساعد في تقليل التكرار المفرط، عندما تشعر برغبة ملحة في غسل يديك، حاول القيام بنشاط آخر يصرف انتباهك مثل القراءة او ممارسة الرياضة، تذكر ان غسل اليدين بشكل مفرط ليس ضروريًا إذا لم تكن هناك حاجة حقيقية لذلك. يمكنك التحدث مع طبيب لتحديد متى يكون غسل اليدين ضروريًا فعلاً، حاول التركيز على الافكار الإيجابية وذكّر نفسك بان القلق لا يغير الواقع وان الخوف من فقدان الاحباء هو جزء طبيعي من الحياة لكنه لا يجب ان يسيطر على حياتك."
    ]
  },
  {
    "tag": "ar-fact-337",
    "patterns": [
      "لا استطيع النوم جيدا",
      "لدي صعوبة في النوم",
      "اعاني من الارق"
    ],
    "responses": [
      "تاكد من ان السرير والوسائد مريحة، وقلل من الضوضاء والإضاءة، تجنب استخدام الهواتف الذكية او مشاهدة التلفاز قبل النوم، حيث ان الضوء الازرق يمكن ان يؤثر على إفراز هرمون الميلاتونين المسؤول عن تنظيم النوم، تجنب تناول الكافيين قبل النوم بعدة ساعات، وايضًا تجنب تناول وجبات ثقيلة قبل النوم مباشرة، إذا كنت تاخذ قيلولات خلال النهار، حاول ان تجعلها قصيرة ولا تتجاوز 20-30 دقيقة، ويفضل ان تكون في وقت مبكر من اليوم",
      "صعوبة النوم يمكن ان تكون نتيجة للقلق او التوتر او العديد من العوامل الاخرى. هنا بعض النصائح التي قد تساعدك على تحسين جودة نومك: حافظ على جدول نوم منتظم، حاول الذهاب إلى الفراش والاستيقاظ في نفس الوقت كل يوم، حتى في عطلات نهاية الاسبوع، اجعل غرفة نومك مريحة وهادئة."
    ]
  },
  {
    "tag": "ar-fact-338",
    "patterns": ["اخاف من الحشرات حتى لو كانت صغيرة و غير مؤذية"],
    "responses": [
      "الخوف من الحشرات هو شعور شائع يمكن ان يكون مزعجًا ويؤثر على حياتك اليومية. إذا كان هذا الخوف يسبب لك قلقًا شديدًا، فقد يكون جزءًا من فوبيا (رهاب) الحشرات. هنا بعض النصائح التي قد تساعدك في التعامل مع هذا الخوف: معرفة المزيد عن الحشرات يمكن ان يساعد في تقليل الخوف. عندما تعرف ان معظم الحشرات غير مؤذية، قد تشعر بمزيد من الراحة، حاول تعريض نفسك للحشرات بشكل تدريجي. ابدا بالنظر إلى صور الحشرات، ثم شاهد مقاطع فيديو، وفي النهاية حاول الاقتراب منها في الحياة الواقعية إذا كنت تشعر بالراحة. هذه العملية تُعرف بالتعرض التدريجي وهي فعالة في التغلب على الفوبيا، حاول الحفاظ على بيئتك نظيفة وتقليل فرص تواجد الحشرات. استخدام المبيدات الحشرية واتخاذ تدابير الوقاية يمكن ان يقلل من مواجهة الحشرات."
    ]
  },
  {
    "tag": "ar-fact-339",
    "patterns": [
      "اشعر بالتوتر عند مقابلة اشخاص جدد",
      "اجد صعوبة في تكوين صداقات",
      "اشعر بعدم الراحة عند التواجد في اماكن مزدحمة"
    ],
    "responses": [
      "ما تشعر به شائع ويمكن ان يكون نتيجة للقلق الاجتماعي، وهو نوع من القلق الذي يظهر عند التفاعل مع الآخرين. هناك عدة خطوات يمكن ان تساعدك في التغلب على هذا الشعور: حاول البدء بمواقف بسيطة، مثل التحدث مع شخص واحد في مكان مريح لك، ثم زيد تدريجيًا من التعرض للمواقف الاجتماعية، حاول التركيز على الجوانب الإيجابية في المواقف الاجتماعية، وتجنب التفكير في السيناريوهات السلبية، حاول الانضمام إلى مجموعات او نوادي تهتم بنفس اهتماماتك، حيث يمكن ان يكون لديك موضوع مشترك للحديث ويمكن ان يسهل ذلك التفاعل الاجتماعي."
    ]
  }
]
