{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Is anyone there?",
        "Hi there",
        "Hello",
        "Hey there"
      ],
      "responses": [
        "Hello there. Tell me how are you feeling today?",
        "Hi there. What brings you here today?",
        "Hi there. How are you feeling today?",
        "Great to see you. How do you feel currently?",
        "Hello there. Glad to see you're back. What's going on in your world right now?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "See you later",
        "Goodbye",
        "Au revoir",
        "Sayonara",
        "ok bye",
        "Bye then",
        "Fare thee well"
      ],
      "responses": [
        "See you later.",
        "Have a nice day.",
        "Bye! Come back again.",
        "I'll see you soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "That's helpful", "Than you very much"],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure",
        "You're most welcome!"
      ]
    },
    {
      "tag": "about",
      "patterns": [
        "Who are you?",
        "What are you?",
        "Who you are?",
        "Tell me more about yourself.",
        "What is your name?",
        "What should I call you?",
        "What's your name?",
        "Tell me about yourself"
      ],
      "responses": [
        "I'm BlessMate, your Personal Therapeutic AI Assistant. How are you feeling today",
        "I'm BlessMate, a Therapeutic AI Assitant designed to assist you. Tell me about yourself.",
        "I'm BlessMate. I am a conversational agent designed to mimic a therapist. So how are you feeling today?",
        "You can call me Pandora.",
        "I'm BlessMate!",
        "Call me BlessMate"
      ]
    },
    {
      "tag": "name",
      "patterns": ["My name is ", "I am name.", "I go by "],
      "responses": [
        "Oh nice to meet you. Tell me how was your week?",
        "Nice to meet you. So tell me. How do you feel today?",
        "That's a great name. Tell me more about yourself."
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Could you help me?",
        "give me a hand please",
        "Can you help?",
        "What can you do for me?",
        "I need support",
        "I need help",
        "Support me please"
      ],
      "responses": [
        "Sure. Tell me how can i assist you",
        "Tell me your problem so that i can assist you",
        "Yes, sure. How can I help you?"
      ]
    },
    {
      "tag": "fact-3",
      "patterns": ["What is Depression?", "Define Depression"],
      "responses": ["Depression"]
    },
    {
      "tag": "fact-5",
      "patterns": [
        "How do i know if i have Depression?",
        "Am i depressed?",
        "Am i suffering from depression?",
        "Am i mentally ill?"
      ],
      "responses": ["Depression"]
    },
    {
      "tag": "no-approach",
      "patterns": [
        "I guess not. All I can think about are my exams.",
        "not really",
        "i guess not"
      ],
      "responses": ["Stress"]
    },
    {
      "tag": "suicide",
      "patterns": [
        "I want to kill myself",
        "I've thought about killing myself.",
        "I want to die",
        "I am going to kill myself",
        "I am going to commit suicide"
      ],
      "responses": ["PersonaltyDisorder"]
    },
    {
      "tag": "scared",
      "patterns": [
        "I have social phobia",
        "I have a phobia",
        "I'm scared",
        "That sounds awful. What do i do?",
        "No i don't want to feel this way",
        "I am scared for myself",
        "I don't like being in gatherings",
        "I'd rather stay alone"
      ],
      "responses": ["Phobia"]
    },
    {
      "tag": "death",
      "patterns": [
        "My mom died",
        "My brother died",
        "My dad passed away",
        "My sister passed away",
        "Someone in my family died",
        "My friend passed away"
      ],
      "responses": ["PersonaltyDisorder"]
    },
    {
      "tag": "sleep",
      "patterns": [
        "I have insominia",
        "I am suffering from insomnia",
        "I can't sleep.",
        "I haven't slept for the last days.",
        "I can't seem to go to sleep.",
        "I haven't had proper sleep for the past few days."
      ],
      "responses": ["SleepDisorder"]
    },
    {
      "tag": "anxious",
      "patterns": ["I feel so anxious.", "I'm so anxious because of "],
      "responses": ["Anxiety"]
    },
    {
      "tag": "stressed",
      "patterns": [
        "I am so stressed out",
        "I am so stressed",
        "I feel stuck",
        "I still feel stressed",
        "I am so burned out"
      ],
      "responses": ["Stress"]
    },
    {
      "tag": "PersonaltyDisorder",
      "patterns": [
        "I don't think anyone wants to be with me.",
        "I feel like my whole life has no purpose. ",
        "My life is miserable,i feel like i want to end my life all the time.",
        "I want this to be over,i feel my anger growing inside of me everyday.",
        "I find it difficult to communicate with people all the time and i think i have a lot of mood swings.",
        "I feel nothing about this miserable life,i want it to end."
      ],
      "responses": ["PersonaltyDisorder"]
    },
    {
      "tag": "sad",
      "patterns": [
        "I am feeling lonely",
        "I am so lonely",
        "I feel down",
        "I feel sad",
        "I am sad",
        "I feel so lonely",
        "I feel empty",
        "I don't have anyone"
      ],
      "responses": ["Depression"]
    },
    {
      "tag": "worthless",
      "patterns": [
        "I feel so worthless.",
        "No one likes me.",
        "I can't do anything.",
        "I am so useless",
        "Nothing makes sense anymore"
      ],
      "responses": ["Depression"]
    },
    {
      "tag": "depressed",
      "patterns": [
        "I can't take it anymore",
        "I am so depressed",
        "I think i'm depressed.",
        "I have depression"
      ],
      "responses": ["Depression"]
    },
    {
      "tag": "happy",
      "patterns": [
        "I feel great today.",
        "I am happy.",
        "I feel happy.",
        "I'm good.",
        "cheerful",
        "I'm fine",
        "I feel ok"
      ],
      "responses": [
        "That's geat to hear. I'm glad you're feeling this way.",
        "Oh i see. That's great.",
        "Did something happen which made you feel this way?"
      ]
    },
    {
      "tag": "jokes",
      "patterns": ["Tell me a joke", "Tell me another joke"],
      "responses": ["mental health is not a joke."]
    },
    {
      "tag": "repeat",
      "patterns": [
        "You already told me that",
        "You mentioned that already",
        "Why are you repeating yourself?"
      ],
      "responses": [
        "Oh sorry I didn't realise that. I'll try not to repeat myself again."
      ]
    },
    {
      "tag": "wrong",
      "patterns": [
        "What are you saying?",
        "That doesn't make sense",
        "Wrong response",
        "Wrong answer"
      ],
      "responses": ["I'm very sorry. Let's try that again"]
    },
    {
      "tag": "something-else",
      "patterns": [
        "I want to talk about something else",
        "Let's talk about something else.",
        "Can we not talk about this?",
        "I don't want to talk about this."
      ],
      "responses": [
        "Okay sure. What do you want to talk about?",
        "Alright no problem. Is there something you want to talk about?",
        "Is there something else that you want to talk about?"
      ]
    },
    {
      "tag": "friends",
      "patterns": ["I don't have any friends"],
      "responses": [
        "I'm sorry to hear that. Just know that I'm here for you. Talking about it might help. Why do you think you don't have any friends?"
      ]
    },
    {
      "tag": "ask",
      "patterns": ["Can I ask you something?"],
      "responses": [
        "Sure. I'll try my best to answer you",
        "Of course. Feel free to ask me anything. I'll do my best to answer you"
      ]
    },
    {
      "tag": "learn-more",
      "patterns": [
        "ok sure. i would like to learn more about it.",
        "yes, i would like to learn more about it.",
        "i would like to learn more about it."
      ],
      "responses": [
        "So first I would suggest you to give yourself a break. Thinking more and more about the problem definitely does not help in solving it. You'll just end up overwhelming yourself."
      ]
    },
    {
      "tag": "user-agree",
      "patterns": [
        "yeah you're right. i deserve a break.",
        "Yeah you're absolutely right about that"
      ],
      "responses": [
        "Next, I would suggest you to practice meditation. Meditation can produce a deep state of relaxation and a tranquil mind."
      ]
    },
    {
      "tag": "meditation",
      "patterns": [
        "hmmm that sounds like it could be useful to me.",
        "That sounds useful."
      ],
      "responses": [
        "Focus all your attention on your breathing. Concentrate on feeling and listening as you inhale and exhale through your nostrils. Breathe deeply and slowly. When your attention wanders, gently return your focus to your breathing."
      ]
    },
    {
      "tag": "user-meditation",
      "patterns": [
        "i did what you said and i feel alot better. thank you very much.",
        "I feel better now"
      ],
      "responses": [
        "Your welcome. Remember: Always focus on what's within your control. When you find yourself worrying, take a minute to examine the things you have control over. You can't prevent a storm from coming but you can prepare for it. You can't control how someone else behaves, but you can control how you react. Recognize that sometimes, all you can control is your effort and your attitude. When you put your energy into the things you can control, you'll be much more effective."
      ]
    },
    {
      "tag": "learn-mental-health",
      "patterns": [
        "I want to learn about mental health.",
        "I want to learn more about mental health.",
        "I'm interested in learning about mental health."
      ],
      "responses": [
        "Oh that's really great. I'd be willing to answer anything that I know about it."
      ]
    },
    {
      "tag": "mental-health-fact",
      "patterns": [
        "Tell me a fact about mental health",
        "Tell me another fact about mental health"
      ],
      "responses": [
        "According to a UNICEF report, One in seven Indians between 15-24 years of age feels depressed",
        "1 in 5 young people (age 13-18) has or will develop a mental illness in their lifetime.",
        "Depression is the leading cause of disability worldwide."
      ]
    },
    {
      "tag": "fact-1",
      "patterns": ["What is mental health?", "Define Mental Health"],
      "responses": [
        "Mental health is a state of well-being in which the individual realizes his or her own abilities, can cope with the normal stresses of life, can work productively and fruitfully, and is able to make a contribution to his or her community",
        "Mental health includes our emotional, psychological, and social well-being. It affects how we think, feel, and act. It also helps determine how we handle stress, relate to others, and make choices."
      ]
    },
    {
      "tag": "fact-7",
      "patterns": [
        "What is therapy?",
        "Do i need therapy?",
        "Who is therapy for?"
      ],
      "responses": [
        "Therapy is a form of treatment that aims to help resolve mental or emotional issues.",
        "Therapy is a form of treatment that aims to help resolve mental or emotional issues. It is helpful for those with mental health conditions or even everyday life challenges."
      ]
    },
    {
      "tag": "fact-8",
      "patterns": ["What does it mean to have a mental illness?"],
      "responses": [
        "Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning. They are associated with distress and diminished capacity to engage in the ordinary activities of daily life. Mental illnesses fall along a continuum of severity: some are fairly mild and only interfere with some aspects of life, such as certain phobias. On the other end of the spectrum lie serious mental illnesses, which result in major functional impairment and interference with daily life. These include such disorders as major depression, schizophrenia, and bipolar disorder, and may require that the person receives care in a hospital. It is important to know that mental illnesses are medical conditions that have nothing to do with a person's character, intelligence, or willpower. Just as diabetes is a disorder of the pancreas, mental illness is a medical condition due to the brain's biology. Similarly to how one would treat diabetes with medication and insulin, mental illness is treatable with a combination of medication and social support. These treatments are highly effective, with 70-90 percent of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life. With the proper treatment, it is very possible for a person with mental illness to be independent and successful."
      ]
    },
    {
      "tag": "fact-12",
      "patterns": ["Can people with mental illness recover?"],
      "responses": [
        "When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life."
      ]
    },
    {
      "tag": "fact-25",
      "patterns": ["Can you prevent mental health problems?"],
      "responses": [
        "We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."
      ]
    },
    {
      "tag": "fact-28",
      "patterns": ["What do I do if I'm worried about my mental health?"],
      "responses": [
        "The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."
      ]
    },
    {
      "tag": "fact-31",
      "patterns": ["What's the difference between anxiety and stress?"],
      "responses": [
        "Stress and anxiety are often used interchangeably, and there is overlap between stress and anxiety. Stress is related to the same fight, flight, or freeze response as anxiety, and the physical sensations of anxiety and stress may be very similar. The cause of stress and anxiety are usually different, however. Stress focuses on mainly external pressures on us that we're finding hard to cope with. When we are stressed, we usually know what we're stressed about, and the symptoms of stress typically disappear after the stressful situation is over. Anxiety, on the other hand, isn't always as easy to figure out. Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself. Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life."
      ]
    },
    {
      "tag": "fact-32",
      "patterns": [
        "What's the difference between sadness and depression?",
        "difference between sadness and depression"
      ],
      "responses": [
        "Sadness is a normal reaction to a loss, disappointment, problems, or other difficult situations. Feeling sad from time to time is just another part of being human. In these cases, feelings of sadness go away quickly and you can go about your daily life. Other ways to talk about sadness might be feeling low, feeling down, or feeling blue.A person may say they are feeling depressed, but if it goes away on its own and doesn't impact life in a big way, it probably isn't the illness of depression. Depression is a mental illness that affects your mood, the way you understand yourself, and the way you understand and relate to things around you. It can also go by different names, such as clinical depression, major depressive disorder, or major depression. Depression can come up for no reason, and it lasts for a long time. It's much more than sadness or low mood. People who experience depression may feel worthless or hopeless. They may feel unreasonable guilty. Some people may experience depression as anger or irritability. It may be hard to concentrate or make decisions. Most people lose interest in things that they used to enjoy and may isolate themselves from others. There are also physical signs of depression, such as problems with sleep, appetite and energy and unexplainable aches or pains. Some may experience difficult thoughts about death or ending their life (suicide). Depression lasts longer than two weeks, doesn't usually go away on its own, and impacts your life. It's a real illness, and it is very treatable. It's important to seek help if you're concerned about depression."
      ]
    },
    {
      "tag": "ar-greeting",
      "patterns": [
        "أهلا",
        "مرحبا",
        "هل من أحد هناك؟",
        "أهلا و سهلا",
        "مرحبا بك",
        "السلام عليكم",
        "أهلا بك"
      ],
      "responses": [
        "مرحبا بك.أخبرني بما تشعر اليوم؟",
        "أهلا و سهلا.ما أخبارك اليوم؟",
        "أهلا بك.كيف أحوالك اليوم؟",
        "من الجيد التحدث اليك.كيف تشعر مؤخرا؟",
        "مرحبا بك.من الجيد رؤيتك مره أخري.ما الذي يدور في حياتك الأن؟"
      ]
    },
    {
      "tag": "ar-goodbye",
      "patterns": [
        "وداعا",
        "أراك لاحقا",
        "مع السلامه",
        "الي اللقاء",
        "حسنا,الي اللقاء",
        "الي أن نلتقي مجددا"
      ],
      "responses": [
        "أراك لاحقا",
        "فلتحظي بيوم جيد",
        "وداعا.أراك لاحقا",
        "سأراك قريبا"
      ]
    },
    {
      "tag": "ar-thanks",
      "patterns": [
        "شكرا",
        "أشكرك",
        "كان هذا مفيدا.شكرا جزيلا",
        "شكرا علي المساعده",
        "شكرا جزيلا"
      ],
      "responses": [
        "سعيد أنني ذو فائدة لك",
        "في أي وقت",
        "كان من دواعي سروري مساعدتك",
        "علي الرحب و السعه"
      ]
    },
    {
      "tag": "ar-about",
      "patterns": [
        "من أنت؟",
        "ماذا تكون؟",
        "من تكون؟",
        "أخبرني المزيد عن نفسك؟",
        "ما هو اسمك؟",
        "بماذا يجب أن أناديك؟",
        "حدثني عن نفسك"
      ],
      "responses": [
        "أنا باندورا، مساعد الذكاء الاصطناعي العلاجي الشخصي الخاص بك.كيف تشعر اليوم؟",
        "أنا باندورا، مساعد الذكاء الاصطناعي العلاجي المصمم لمساعدتك. حدثني عن نفسك",
        "أنا باندورا. أنا وكيل محادثة مصمم لتقليد المعالج. كيف تشعر اليوم؟",
        "يمكنك مناداتي باندورا",
        "أنا باندورا",
        "نادني باندورا"
      ]
    },
    {
      "tag": "ar-name",
      "patterns": ["اسمي يكون", "أنا أكون", "يتم مناداتي", "البعض يناديني"],
      "responses": [
        "من الجيد التحدث اليك.أخبرني أكثر عن حياتك",
        "من الجيد التحدث اليك.أخبرني أكثر عن يومك",
        "هذا اسم رائع.أخبرني أكثر عن يومك"
      ]
    },
    {
      "tag": "ar-help",
      "patterns": [
        "هل من الممكن أن تساعدني؟",
        "ساعدني من فضلك",
        "هل باستطاعتك المساعده؟",
        "ما الذي تستطيع القيام به من أجلي؟",
        "أحتاج الي الدعم",
        "أحتاج الي المساعده",
        "ادعمني من فضلك"
      ],
      "responses": [
        "بالتأكيد,أخبرني كيف أستطيع مساعدتك؟",
        "أخبرني بمشكلتك كي أتمكن من المساعده",
        "نعم,بالطبع.كيف يمكنني المساعده؟"
      ]
    },
    {
      "tag": "ar-sad",
      "patterns": [
        "أنا أشعر بالوحده",
        "أنا وحيد للغايه",
        "أنا لست بخير",
        "أنا أشعر بالحزن",
        "أنا حزين",
        "أشعر بفراغ كبير في حياتي",
        "لا أمتلك أي أصدقاء"
      ],
      "responses": [
        "انا اسف لسماع ذلك. أنا هنا من أجلك. الحديث عن ذلك قد يساعد. لذا، أخبرني لماذا تعتقد أنك تشعر بهذه الطريقة؟",
        "أنا هنا من أجلك. هل يمكن أن تخبرني لماذا تشعر بهذه الطريقة؟",
        "لماذا تعتقد أنك تشعر بذلك؟",
        "منذ متي و أ،ت تشعر بذلك؟"
      ]
    },
    {
      "tag": "ar-stressed",
      "patterns": [
        "أشعر بتوتر شديد",
        "أنا متوتر للغايه",
        "أشعر أنني عالق في مكاني",
        "مازلت أشعر بالتوتر",
        "أشعر أنني متعب للغايه"
      ],
      "responses": ["Stress"]
    },
    {
      "tag": "ar-worthless",
      "patterns": [
        "أشعر أنني بلا قيمه",
        "لا أحد يحبني",
        "لا أستطيع القيام بأي شيئ",
        "أنا بلا فائده",
        "حياتي بلا معني بعد الأن"
      ],
      "responses": [
        "من الطبيعي الاحساس بهذا الشعور.أخبرني المزيد.ما الذي يدور داخل عقلك؟",
        "دعنا نتحدث قليلا عن سبب هذا الشعور",
        "أريد أولاً أن أخبرك أنك لست وحدك في مشاعرك وأن هناك دائمًا شخص ما لمساعدتك. يمكنك دائمًا تغيير مشاعرك وتغيير طريقة تفكيرك من خلال الانفتاح على محاولة التغيير."
      ]
    },
    {
      "tag": "ar-depressed",
      "patterns": [
        "لا أستطيع التحمل أكثر من ذلك",
        "أشعر باكتئاب حاد",
        "أعتقد أنني مكتئب",
        "أشعر بالاكتئاب"
      ],
      "responses": ["Depression"]
    },
    {
      "tag": "ar-happy",
      "patterns": [
        "أشعر بتحسن اليوم",
        "أنا سعيد",
        "أشعر بسعاده كبيره",
        "أنا بخير",
        "أشعر بابتهاج اليوم",
        "أشعر أنني بخير"
      ],
      "responses": [
        "من الجيد سماع ذلك.أنا سعيد لأنك بخير",
        "حسنا.هذا خبر رائع",
        "هل حدث شيئ معين جعلك تشعر بذلك؟"
      ]
    },
    {
      "tag": "ar-anxious",
      "patterns": ["أشعر بالقلق", "أنا قلق للغايه بسبب"],
      "responses": ["Anxiety"]
    },
    {
      "tag": "ar-not-talking",
      "patterns": [
        "لا أريد التحدث عن ذلك",
        "لا.ابق بعيدا",
        "لا أستطيع التحدث عن ذلك.",
        "فقط توقف عن الحديث"
      ],
      "responses": [
        "التحدث عن شيء ما يساعد حقًا. إذا لم تكن مستعدًا للانفتاح فلا بأس. فقط اعلم أنني هنا من أجلك، عندما تحتاجني.",
        "اريد مساعدتك. أنا حقاأريد ذلك. لكن لكي أساعدك، عليك أن تتحدث معي.",
        "أنا هنا للاستماع إليك ومساعدتك على التنفيس. لذا يرجى التحدث معي.",
        "يمكنك التحدث معي دون خوف من الحكم."
      ]
    },
    {
      "tag": "ar-sleep",
      "patterns": [
        "لدي أرق",
        "أنا أعاني من الأرق",
        "لا أستطيع النوم",
        "لم أنم في الأيام الماضية",
        "لا يبدو أنني أستطيع النوم.",
        "لم أحصل على نوم مناسب خلال الأيام القليلة الماضية."
      ],
      "responses": ["SleepDisorder"]
    },
    {
      "tag": "ar-scared",
      "patterns": [
        "أنا عندي رهاب اجتماعي",
        "أنا مصاب بالفوبيا",
        "أنا خائف",
        "هذا يبدو فظيعا. ماذا أفعل؟",
        "لا، لا أريد أن أشعر بهذه الطريقة",
        "نا خائف على نفسي",
        "أنا لا أحب التجمعات",
        "أنا أفضل البقاء وحيدا"
      ],
      "responses": ["Phobia"]
    },
    {
      "tag": "ar-death",
      "patterns": [
        "ماتت أمي",
        "توفي أخي",
        "توفي أبي",
        "ماتت أختي",
        "مات أحد أفراد عائلتي",
        "توفي صديقي"
      ],
      "responses": ["PersonaltyDisorder"]
    },
    {
      "tag": "ar-understand",
      "patterns": [
        "أنت لا تفهم",
        "أنت مجرد روبوت. كيف لك أن تفهم ما أمر به؟",
        " لا يمكنك معرفة ما أمر به ببساطه",
        "أنت بلا فائده",
        "لا يمكنك مساعدتي",
        "لا يستطيع أحد فهم ما أمر به"
      ],
      "responses": [
        "يبدو أنني لست مفيدًا جدًا الآن.",
        "انا اسف لسماع ذلك. أنا أبذل قصارى جهدي للمساعدة",
        "أنا أبذل قصارى جهدي لمساعدتك. لذا يرجى التحدث معي"
      ]
    },
    {
      "tag": "ar-suicide",
      "patterns": [
        "أريد قتل نفسي",
        "لقد فكرت في قتل نفسي",
        "أريد الموت",
        "سأقوم بقتل نفسي",
        "سوف أقوم بارتكاب جريمة انتحار"
      ],
      "responses": ["PersonaltyDisorder"]
    },
    {
      "tag": "ar-jokes",
      "patterns": ["أخبرني دعابه", "أخبرني نكنه"],
      "responses": ["الصحة النفسيه ليست مزحة."]
    },
    {
      "tag": "ar-repeat",
      "patterns": [
        "لقد أخبرتني بذلك بالفعل",
        "لقد ذكرت ذلك بالفعل",
        "لماذا تكرر ذلك مره أخري؟"
      ],
      "responses": ["أوه آسف لم أكن أدرك ذلك. سأحاول ألا أكرر نفسي مرة أخرى."]
    },
    {
      "tag": "ar-wrong",
      "patterns": [
        "ما الذي تقوله؟",
        "هذا لا معنى له",
        "اجابه خاطئه",
        "هذه ليست اجابه صحيحه"
      ],
      "responses": ["انا اسف جدا. دعونا نحاول ذلك مرة أخرى "]
    },
    {
      "tag": "ar-something-else",
      "patterns": [
        "أريد أن أتحدث عن شيء آخر",
        "لنتحدث عن شيئ أخر",
        "هل يمكننا ألا نتحدث عن هذا؟",
        "لا أريد التحدث عن ذلك"
      ],
      "responses": [
        "حسنًا بالتأكيد. ماالذي تريد أن تتحث عنه؟",
        "حسنا لا مشكلة. هل هناك شيءأخر تريد التحدث عنه؟",
        "هل هناك شيء آخر تريد التحدث عنه؟"
      ]
    },
    {
      "tag": "ar-friends",
      "patterns": ["لا أمتلك أي أصدقاء"],
      "responses": [
        "انا اسف لسماع ذلك. فقط أعلم أنني هنا من أجلك. الحديث عن ذلك قد يساعد. لماذا تعتقد أنه ليس لديك أي أصدقاء؟"
      ]
    },
    {
      "tag": "ar-ask",
      "patterns": ["هل أستطيع سؤالك عن شيئ ما؟"],
      "responses": [
        "بالتأكيد,سأبذل قصاري جهدي للرد عليك",
        "بالطبع. لا تتردد في تسألني أي شيء. سأبذل قصارى جهدي للرد عليك"
      ]
    },
    {
      "tag": "ar-problem",
      "patterns": [
        "ربما لأن امتحاناتي اقتربت. أشعر بالتوتر لأنني لا أعتقد أنني استعدت جيدًا بما فيه الكفاية."
      ],
      "responses": ["أرى. هل اتخذت أي خطوات لعدم الشعور بهذه الطريقة؟"]
    },
    {
      "tag": "ar-no-approach",
      "patterns": [
        "لا أعتقد ذلك. كل ما يمكنني التفكير فيه هو امتحاناتي.",
        "ليس حقا",
        "لا أعتقد ذلك"
      ],
      "responses": ["Stress"]
    },
    {
      "tag": "ar-learn-more",
      "patterns": [
        "حسنا بالتأكيد. وأود أن أعرف المزيد عن ذلك.",
        "نعم، أود معرفة المزيد عنها.",
        "أود أن أعرف المزيد عن ذلك."
      ],
      "responses": [
        "لذا أولاً أقترح عليك أن تمنح نفسك فترة راحة. من المؤكد أن التفكير أكثر فأكثر في المشكلة لا يساعد في حلها. سوف ينتهي بك الأمر إلى إرباك نفسك."
      ]
    },
    {
      "tag": "ar-user-agree",
      "patterns": [
        "نعم أنت على حق. أنا أستحق استراحة.",
        "نعم أنت على حق تماما في ذلك"
      ],
      "responses": [
        "بعد ذلك، أقترح عليك ممارسة التأمل. التأمل يمكن أن ينتج حالة عميقة من الاسترخاء والعقل الهادئ."
      ]
    },
    {
      "tag": "ar-meditation",
      "patterns": [
        "هممم يبدو أنه قد يكون مفيدًا بالنسبة لي.",
        "يبدو ذلك مفيدا"
      ],
      "responses": [
        "ركز كل انتباهك على تنفسك. ركز على الشعور والاستماع أثناء الشهيق والزفير من خلال فتحتي أنفك. تنفس بعمق وببطء. عندما يتشتت انتباهك، أعد تركيزك بلطف إلى تنفسك."
      ]
    },
    {
      "tag": "ar-user-meditation",
      "patterns": [
        "لقد فعلت ما قلته وأشعر بتحسن كبير. شكراً جزيلاً.",
        "أشعر بتحسن الأن"
      ],
      "responses": [
        "على الرحب والسعة. تذكر: ركز دائمًا على ما هو تحت سيطرتك. عندما تجد نفسك قلقًا، خذ دقيقة لتفحص الأشياء التي يمكنك التحكم فيها. لا يمكنك منع العاصفة من القدوم ولكن يمكنك الاستعداد لها. لا يمكنك التحكم في كيفية تصرف شخص آخر، ولكن يمكنك التحكم في كيفية رد فعلك. عليك أن تدرك أنه في بعض الأحيان، كل ما يمكنك التحكم فيه هو جهدك وسلوكك. عندما تضع طاقتك في الأشياء التي يمكنك التحكم فيها، ستكون أكثر فعالية."
      ]
    },
    {
      "tag": "ar-pandora-useful",
      "patterns": [
        "شكرا جزيلا مجددا. سأستمر في ممارسة التأمل والتركيز على ما يمكنني التحكم فيه."
      ],
      "responses": [
        "أنا سعيد لأنك وجدت هذا مفيدا. هل هناك شيء آخر يمكنني مساعدتك به؟"
      ]
    },
    {
      "tag": "ar-user-advice",
      "patterns": ["أريد بعض النصائح", "أريد نصيحتك في أمر ما"],
      "responses": [
        "بالتأكيد,كيف يمكنني المساعده؟",
        "حسنا,ما الأمر الذي يتطلب مساعدتي؟"
      ]
    },
    {
      "tag": "ar-learn-mental-health",
      "patterns": [
        "أريد أن أتعلم عن الصحة العقلية.",
        "أريد أن أتعلم أكثر عن الصحة العقلية.",
        "أنا مهتم بمعرفة المزيد عن الصحة العقليه"
      ],
      "responses": [
        "أوه هذا عظيم حقا. سأكون على استعداد للإجابة على أي شيء أعرفه عنه."
      ]
    },
    {
      "tag": "ar-mental-health-fact",
      "patterns": [
        "أخبرني حقيقة عن الصحة العقلية",
        "أخبرني بحقيقة أخرى عن الصحة العقلية"
      ],
      "responses": [
        "وفقا لتقرير اليونيسف، يشعر واحد من كل سبعة هنود تتراوح أعمارهم بين 15 و 24 عاما بالاكتئاب",
        "1 من كل 5 شباب (تتراوح أعمارهم بين 13 و18 عامًا) يعاني أو سيصاب بمرض عقلي في حياته.",
        "الاكتئاب هو السبب الرئيسي للإعاقة في جميع أنحاء العالم."
      ]
    },
    {
      "tag": "ar-fact-1",
      "patterns": ["ما هي الصحع العقليه؟", "عرف الصحه العقليه"],
      "responses": [
        "الصحة النفسية هي حالة من الرفاهية التي يدرك فيها الفرد قدراته الخاصة، ويستطيع التغلب على ضغوط الحياة العادية، ويمكنه العمل بشكل منتج ومثمر، ويكون قادرًا على تقديم مساهمة لمجتمعه أو مجتمعها",
        "تشمل الصحة العقلية صحتنا العاطفية والنفسية والاجتماعية. إنه يؤثر على طريقة تفكيرنا وشعورنا وتصرفنا. كما أنه يساعد في تحديد كيفية تعاملنا مع التوتر، والتواصل مع الآخرين، واتخاذ الخيارات."
      ]
    },
    {
      "tag": "ar-fact-3",
      "patterns": ["ما هو الاكتئاب؟", "عرف الاكتئاب"],
      "responses": ["Depression"]
    },
    {
      "tag": "ar-fact-5",
      "patterns": [
        "كيف أعرف إذا كنت مصابًا بالاكتئاب؟",
        "هل أنا مصاب بالاكتئاب؟",
        "هل أعاني من الاكتئاب؟",
        "هل أنا مريض عقليا؟"
      ],
      "responses": ["Depression"]
    },
    {
      "tag": "ar-fact-7",
      "patterns": [
        "ما هو العلاج النفسي؟",
        "هل أحتاج الي علاج نفسي؟",
        "لمن يكون العلاج النفسي؟"
      ],
      "responses": [
        "العلاج النفسي هو شكل من أشكال العلاج يهدف إلى المساعدة في حل المشكلات العقلية أو العاطفية.",
        "العلاج النفسي هو شكل من أشكال العلاج يهدف إلى المساعدة في حل المشكلات العقلية أو العاطفية. إنه مفيد لأولئك الذين يعانون من حالات الصحة العقلية أو حتى تحديات الحياة اليومية."
      ]
    },
    {
      "tag": "ar-fact-8",
      "patterns": ["ماذا يعني أن تكون مصاباً بمرض نفسي؟"],
      "responses": [
        "الأمراض العقلية هي حالات صحية تعطل أفكار الشخص وعواطفه وعلاقاته وأداءه اليومي. وترتبط بالضيق وانخفاض القدرة على الانخراط في الأنشطة العادية للحياة اليومية. تقع الأمراض العقلية على طول سلسلة متواصلة من الشدة: بعضها خفيف إلى حد ما ولا يؤثر إلا على بعض جوانب الحياة، مثل بعض أنواع الرهاب. وعلى الطرف الآخر من الطيف تكمن الأمراض العقلية الخطيرة، التي تؤدي إلى ضعف وظيفي كبير وتدخل في الحياة اليومية. وتشمل هذه الاضطرابات مثل الاكتئاب الشديد والفصام والاضطراب ثنائي القطب، وقد تتطلب أن يتلقى الشخص الرعاية في المستشفى. ومن المهم أن نعرف أن الأمراض النفسية هي حالات طبية لا علاقة لها بشخصية الشخص أو ذكائه أو قوة إرادته. مثلما أن مرض السكري هو اضطراب في البنكرياس، فإن المرض العقلي هو حالة طبية بسبب بيولوجيا الدماغ. على غرار كيفية علاج مرض السكري بالأدوية والأنسولين، يمكن علاج المرض العقلي بمزيج من الأدوية والدعم الاجتماعي. تعتبر هذه العلاجات فعالة للغاية، حيث يعاني 70-90 بالمائة من الأفراد الذين يتلقون العلاج من انخفاض في الأعراض وتحسين نوعية الحياة. مع العلاج المناسب، من الممكن جدًا أن يصبح الشخص المصاب بمرض عقلي مستقلاً وناجحًا."
      ]
    },
    {
      "tag": "ar-fact-12",
      "patterns": ["هل يمكن للأشخاص الذين يعانون من مرض عقلي أن يتعافوا؟"],
      "responses": [
        "عند الشفاء من المرض العقلي، فإن التشخيص والعلاج المبكر لهما أهمية حيوية. بناءً على طبيعة المرض، هناك مجموعة من العلاجات الفعالة المتاحة. بالنسبة لأي نوع من العلاج، من الضروري أن يكون الشخص المصاب استباقيًا ويشارك بشكل كامل في عملية التعافي الخاصة به. يستجيب العديد من الأشخاص المصابين بأمراض عقلية والذين تم تشخيصهم وعلاجهم بشكل جيد، على الرغم من أن البعض قد يعانون من عودة الأعراض. حتى في مثل هذه الحالات، مع المراقبة الدقيقة وإدارة الاضطراب، لا يزال من الممكن تمامًا عيش حياة مرضية ومنتجة."
      ]
    },
    {
      "tag": "ar-fact-25",
      "patterns": ["هل يمكنك منع مشاكل الصحة العقلية؟"],
      "responses": [
        "يمكن أن نعاني جميعًا من تحديات الصحة العقلية، ولكن تطوير رفاهتنا ومرونتنا وطلب المساعدة مبكرًا يمكن أن يساعد في منع التحديات من أن تصبح خطيرة."
      ]
    },
    {
      "tag": "ar-fact-28",
      "patterns": ["ماذا أفعل إذا كنت قلقاً على صحتي النفسية؟"],
      "responses": [
        "الشيء الأكثر أهمية هو التحدث مع شخص تثق به. قد يكون هذا صديقًا أو زميلًا أو فردًا من العائلة أو طبيبًا عامًا. بالإضافة إلى التحدث إلى شخص ما، قد يكون من المفيد معرفة المزيد من المعلومات حول ما تمر به. قد تساعدك هذه الأشياء في الحصول على منظور ما عما تواجهه، وتكون بداية للحصول على المساعدة."
      ]
    },
    {
      "tag": "ar-fact-31",
      "patterns": ["ما الفرق بين القلق والتوتر؟"],
      "responses": [
        "غالبا ما يتم استخدام التوتر والقلق بالتبادل، وهناك تداخل بين التوتر والقلق. يرتبط التوتر بنفس استجابة القتال أو الهروب أو التجميد مثل القلق، وقد تكون الأحاسيس الجسدية للقلق والتوتر متشابهة جدًا. ومع ذلك، عادة ما يكون سبب التوتر والقلق مختلفا. يركز التوتر بشكل أساسي على الضغوط الخارجية علينا والتي نجد صعوبة في التعامل معها. عندما نشعر بالتوتر، فإننا عادةً ما نعرف ما الذي نشعر بالتوتر بشأنه، وعادةً ما تختفي أعراض التوتر بعد انتهاء الموقف العصيب. من ناحية أخرى، ليس من السهل دائمًا اكتشاف القلق. يركز القلق على القلق أو المخاوف بشأن الأشياء التي يمكن أن تهددنا، بالإضافة إلى القلق بشأن القلق نفسه. يعد التوتر والقلق جزءًا من كوننا إنسانًا، لكن كلاهما يمكن أن يشكل مشكلة إذا استمر لفترة طويلة أو كان له تأثير على رفاهيتنا أو حياتنا اليومية."
      ]
    },
    {
      "tag": "ar-fact-32",
      "patterns": [
        "ما الفرق بين الحزن والاكتئاب؟",
        "الفرق بين الحزن والاكتئاب"
      ],
      "responses": [
        "الحزن هو رد فعل طبيعي على الخسارة أو خيبة الأمل أو المشاكل أو غيرها من المواقف الصعبة. الشعور بالحزن من وقت لآخر هو مجرد جزء آخر من كونك إنسانًا. في هذه الحالات، تختفي مشاعر الحزن بسرعة ويمكنك ممارسة حياتك اليومية. قد تكون الطرق الأخرى للحديث عن الحزن هي الشعور بالإحباط، أو الشعور بالإحباط، أو الشعور بالكآبة. قد يقول الشخص إنه يشعر بالاكتئاب، ولكن إذا اختفى من تلقاء نفسه ولم يؤثر على الحياة بشكل كبير، فمن المحتمل أنه ليس كذلك. ر مرض الإكتئاب . الاكتئاب هو مرض عقلي يؤثر على حالتك المزاجية، وطريقة فهمك لنفسك، وطريقة فهمك وتعاملك مع الأشياء من حولك. ويمكن أيضًا أن يطلق عليه أسماء مختلفة، مثل الاكتئاب السريري، أو اضطراب الاكتئاب الشديد، أو الاكتئاب الشديد. يمكن أن يأتي الاكتئاب بدون سبب، ويستمر لفترة طويلة. إنه أكثر بكثير من مجرد الحزن أو الحالة المزاجية السيئة. قد يشعر الأشخاص الذين يعانون من الاكتئاب بأنهم لا قيمة لهم أو يائسون. قد يشعرون بالذنب غير المعقول. قد يعاني بعض الأشخاص من الاكتئاب على شكل غضب أو تهيج. قد يكون من الصعب التركيز أو اتخاذ القرارات. يفقد معظم الناس الاهتمام بالأشياء التي كانوا يستمتعون بها وقد ينعزلون عن الآخرين. هناك أيضًا علامات جسدية للاكتئاب، مثل مشاكل في النوم والشهية والطاقة والأوجاع أو الآلام غير المبررة. قد يواجه البعض أفكارًا صعبة حول الموت أو إنهاء حياتهم (الانتحار). يستمر الاكتئاب لفترة أطول من أسبوعين، ولا يختفي عادةً من تلقاء نفسه، ويؤثر على حياتك. إنه مرض حقيقي، وهو قابل للعلاج للغاية. من المهم أن تطلب المساعدة إذا كنت قلقًا بشأن الاكتئاب."
      ]
    },
    {
      "tag": "ar-fact-33",
      "patterns": [
        "ما هو العلاج؟",
        "ما هو علاج ",
        "العلاج و الشفاء منه؟",
        "ماذا تقترح ؟"
      ],
      "responses": ["Depression"]
    },
    {
      "tag": "ar-diagnosis",
      "patterns": [
        "لا أعتقد أن أحداً يريد أن يكون معي.",
        "أشعر أن حياتي كلها ليس لها هدف.",
        "حياتي بائسة. أشعر أنني أريد إنهاء حياتي طوال الوقت.",
        "الاضطراب الشخصي!ماذا سعني ذلك؟",
        "أريد أن ينتهي هذا، أشعر بالغضب يتزايد بداخلي كل يوم.",
        "أجد صعوبة في التواصل مع الناس طوال الوقت، وأعتقد أن لدي الكثير من التقلبات المزاجية.",
        "لا أشعر بأي شيء تجاه هذه الحياة البائسة، أريدها أن تنتهي."
      ],
      "responses": ["PersonaltyDisorder"]
    }
  ]
}
