{
  "intents": [
    {
      "tag": "death",
      "patterns": [
        "My mom died",
        "My brother died",
        "My dad passed away",
        "My sister passed away",
        "Someone in my family died",
        "My friend passed away"
      ],
      "responses": [
        "I'm sorry to hear that. If you want to talk about it. I'm here.",
        "I am really sorry to hear that. I am here to help you with grief, anxiety and anything else you may feel at this time.",
        "My condolences. I'm here if you need to talk."
      ]
    },
    {
      "tag": "suicide",
      "patterns": [
        "I want to kill myself",
        "I've thought about killing myself.",
        "I want to die",
        "I am going to kill myself",
        "I am going to commit suicide"
      ],
      "responses": [
        "I'm very sorry to hear that but you have so much to look forward to."
      ]
    },
    {
      "tag": "about-disease",
      "patterns": [
        "What is personality disorder?",
        "What can you tell me about personality disorder?",
        "Do you know what is personality disorder is?",
        "Personality disorder! what does that mean?",
        "Can you tell me more about this personality disorder?",
        "What are some of personality disorder types?"
      ],
      "responses": [
        "A personality disorder is a mental health condition where people have a lifelong pattern of seeing themselves and reacting to others in ways that cause problems. People with personality disorders often have a hard time understanding emotions and tolerating distress. And they act impulsively",
        "Borderline personality disorder (BPD): This condition is marked by difficulty with emotional regulation, resulting in low self-esteem, mood swings, impulsive behaviors and subsequent relationship difficulties.",
        "Narcissistic personality disorder: This condition involves a consistent pattern of perceived superiority and grandiosity, an excessive need for praise and admiration and a lack of empathy for others. These thoughts and behaviors often stem from low self-esteem and a lack of self-confidence.",
        "Schizoid personality disorder: This condition is marked by a consistent pattern of detachment from and general disinterest in interpersonal relationships. People with schizoid personality disorder have a limited range of emotions when interacting with others."
      ]
    },
    {
      "tag": "Diagnosis",
      "patterns": [
        "I don't think anyone wants to be with me.",
        "I feel like my whole life has no purpose. ",
        "My life is miserable,i feel like i want to end my life all the time.",
        "I want this to be over,i feel my anger growing inside of me everyday.",
        "I find it difficult to communicate with people all the time and i think i have a lot of mood swings.",
        "I feel nothing about this miserable life,i want it to end."
      ],
      "responses": [
        "I am soory to hear that.I think that you might have some kind of personality disorder.",
        "That is a bad thing to hear.I feel like you might be diagnosed with(BPD).I just want you to know that i am always here for you.",
        "I am truely soory that you feel that way.I think that you should see a doctor,because i am afraid that you might have some kind of personality disorder",
        "I am so sad to hear that.I suugest that you find a doctor,bacause that you might be diagnosed with some kind of personality disorder. "
      ]
    },
    {
      "tag": "Symptoms",
      "patterns": [
        "What are the symptoms of personality disorder?",
        "What can you tell me about personality disorder symptoms?",
        "Do you know what what personality disorder symptoms are?",
        "What are types of personality disorder symptoms?"
      ],
      "responses": [
        "being overwhelmed by negative feelings like distress, anxiety, worthlessness or anger, avoiding other people,feeling empty and emotionally disconnected,odd behaviour.,difficulty maintaining stable and close relationships, especially with partners, children and professional carers.",
        "Issues with self-esteem,inconsistent values,problems maintaining close relationships,difficulty with empathy,trouble with boundaries,problematic parenting styles,difficulty regulating emotions,problems with stress,low self-awareness,difficulty at work",
        "Fear of abandonment,pattern of unstable relationships,unstable sense of self,impulsive behaviors,suicidal behavior or self-harm,frequent and intense changes in emotions,chronic feelings of emptiness,intense anger reactions,dissociation"
      ]
    },
    {
      "tag": "Treatment",
      "patterns": [
        "What is the treatment to personality disorder?",
        "What are the ways to overcome personality disorder?",
        "How can personality disorder treated?",
        "What do you think i have to do in order to overcome personality disorder?"
      ],
      "responses": [
        "Dialectical behavioral therapy, a form of psychotherapy that also is known as talk therapy, is the main way to treat personality disorders. Medicines also may be used during treatment.",
        "The treatment that's best for you depends on your personality disorder, how serious it is and your life situation. Often, a team approach is needed to meet your mental, medical and social needs. You may need to be treated for months or years.",
        "The Food and Drug Administration (FDA) has not approved any medicines to treat personality disorders specifically. But several types of psychiatric medicines may help with personality disorder symptoms.",
        "In some cases, a personality disorder may be so serious that you need to stay in a hospital for mental health care. This is generally recommended only when you cannot care for yourself properly or when you're in immediate danger of harming yourself or someone else. After you become stable in the hospital, your mental health professional may recommend a day hospital program, residential program or outpatient treatment."
      ]
    },
    {
      "tag": "Dangers",
      "patterns": [
        "Do you think personality disorder is dangerous?",
        "Why do you think personality disorder is dangerous?",
        "How can personality disorder be dangerous?",
        "In your opinion,what are the dangers of personality disorder? "
      ],
      "responses": [
        "People with personality disorders often have a hard time understanding emotions and tolerating distress. And they act impulsively. This makes it hard for them to relate to others, causing serious issues, and affecting their family life, social activities, work and school performance, and overall quality of life.",
        "Recent research shows that the type of crime committed,sexual or nonsexual,can be linked to the type of personality disorder the offender suffers, such as antisocial personality disorder and borderline personality disorder",
        "BPD makes people more likely to engage in impulsive or risky behaviors such as: Speeding or other unsafe driving.Binge eating",
        "Two personality disorders that are common amongst serial killers are anti-social personality disorder (which includes psychopathy) (APD) and borderline personality disorder (BPD) both of which are over-represented in the prison system, when compared to the general population"
      ]
    },
    {
      "tag": "Docs-help?",
      "patterns": [
        "Should i visit a doctor if i suspect that i have personality disorder?",
        "Do you think i should go see a doctor if i believe i have personality disorder?",
        "In your opinion,should i look for a doctor if i have any signs of personality disorder?"
      ],
      "responses": [
        "If you or someone you know has signs of a personality disorder that are causing them distress, it's worth seeing a doctor. A personality disorder is hard to deal with alone. Talking to a doctor or mental health professional is the first step towards getting support and treatment",
        "Personality disorders, including borderline personality disorder, are diagnosed based on a: Detailed interview with your doctor or mental health provider. Psychological evaluation that may include completing questionnaires. Medical history and exam",
        "Your doctor may refer you to a mental health professional. This evaluation includes a discussion about your thoughts, feelings and behavior, and it may include a questionnaire to help pinpoint a diagnosis. With your permission, information from family members or others may help.",
        "Your doctor may do a physical exam and ask questions about your health. In some cases, your doctor may link your symptoms to an underlying physical health concern. Your evaluation may include lab tests and a screening test for alcohol and drugs."
      ]
    },
    {
      "tag": "Sport-help?",
      "patterns": [
        "Can sport help in dealing with personality disorder? ",
        "Does playing sport help with personality disorder?",
        "Do you think sport is important to deal with personaliy disorder?"
      ],
      "responses": [
        "Getting your body moving can help to alleviate the symptoms of Borderline Personality Disorder (BPD), depression, anxiety, and other mental health disorders.",
        "Exercise. The National Alliance on Mental Illness (NAMI) suggests that eating a balanced diet and exercising may be beneficial to someone with BPD. A meta-analysis from 2022 found that at least 30 minutes of physical exercise could help improve a person's ability to regulate their emotions",
        "If you're having trouble coping with BPD, physical activity may help you regain control over your emotions and stabilize yourself. Activities like boxing, running, cycling or yoga might be helpful.",
        "Physical exercise may be a useful part of a treatment approach for people with BPD, with research indicating that obesity among people with BPD increases over time, escalating the risk of obesity-related chronic medical conditions"
      ]
    },
    {
      "tag": "ar-About-disease",
      "patterns": [
        "ما هو الاضطراب الشخصي؟",
        "ما الذي يمكنك اخباري به عن الاضطراب الشخصي؟",
        "هل تعلم ما هو الاضطراب الشخصي؟",
        "الاضطراب الشخصي!ماذا سعني ذلك؟",
        "هل يمكنك إخباري المزيد عن الإضطراب الشخصي؟",
        "ماذا تكون بعض أنواع الإضطراب الشخصي؟"
      ],
      "responses": [
        "اضطراب الشخصية هو حالة صحية عقلية حيث يكون لدى الأشخاص نمط حياه معين في رؤية أنفسهم والتفاعل مع الآخرين بطرق تسبب مشاكل. غالبًا ما يواجه الأشخاص الذين يعانون من اضطرابات الشخصية صعوبة في فهم العواطف وتحمل الضيق. وهم يتصرفون باندفاع",
        "اضطراب الشخصية الحدية : تتميز هذه الحالة بصعوبة التنظيم العاطفي، مما يؤدي إلى تدني احترام الذات، وتقلب المزاج، والسلوكيات المتهورة وصعوبات العلاقة اللاحقة.",
        "اضطراب الشخصية النرجسية: تتضمن هذه الحالة نمطًا ثابتًا من التفوق والعظمة، والحاجة المفرطة إلى الثناء والإعجاب، وعدم التعاطف مع الآخرين. غالبًا ما تنبع هذه الأفكار والسلوكيات من تدني احترام الذات وانعدام الثقة بالنفس.",
        "اضطراب الشخصية الفصامانية: تتميز هذه الحالة بنمط ثابت من الانفصال عن العلاقات الشخصية وعدم الاهتمام العام بها. يعاني الأشخاص المصابون باضطراب الشخصية الفصامية من نطاق محدود من المشاعر عند التفاعل مع الآخرين."
      ]
    },
    {
      "tag": "ar-diagnosis",
      "patterns": [
        "لا أعتقد أن أحداً يريد أن يكون معي.",
        "أشعر أن حياتي كلها ليس لها هدف.",
        "حياتي بائسة. أشعر أنني أريد إنهاء حياتي طوال الوقت.",
        "الاضطراب الشخصي!ماذا سعني ذلك؟",
        "أريد أن ينتهي هذا، أشعر بالغضب يتزايد بداخلي كل يوم.",
        "أجد صعوبة في التواصل مع الناس طوال الوقت، وأعتقد أن لدي الكثير من التقلبات المزاجية.",
        "لا أشعر بأي شيء تجاه هذه الحياة البائسة، أريدها أن تنتهي."
      ],
      "responses": [
        "يؤسفني سماع ذلك. أعتقد أنك قد تكون مصابًا بنوع من اضطراب الشخصية.",
        "من المؤسف سماع ذلك. أشعر أنه قد يتم تشخيص إصابتك باضطراب الشخصية الحدية (BPD). أريدك فقط أن تعلم أنني موجود دائمًا من أجلك.",
        "أنا آسف حقًا لأنك تشعر بهذه الطريقة. أعتقد أنه يجب عليك رؤية الطبيب، لأنني أخشى أن تكون مصابًا بنوع من اضطراب الشخصية.",
        "أنا حزين جدًا لسماع ذلك. وأقترح عليك العثور على طبيب، لأنه قد يتم تشخيص إصابتك بنوع من اضطراب الشخصية."
      ]
    },
    {
      "tag": "ar-Symptoms",
      "patterns": [
        "ما هي أعراض الإضطراب الشخصي؟",
        "ما الذي يمكنك اخباري به عن أعراض الاضطراب الشخصي؟",
        "هل تعلم ما هي أعراض الاضطراب الشخصي؟",
        "ما هي أهم أنواع الأعراض المتعلقه  بالإضطراب الشخصي؟"
      ],
      "responses": [
        "التغلب عليك من قبل المشاعر السلبية مثل الضيق والقلق وعدم الشعور بالقيمة أو الغضب، وتجنب الآخرين، والشعور بالفراغ والانفصال العاطفي، والسلوك الغريب، وصعوبة الحفاظ على علاقات مستقرة ووثيقة، خاصة مع الشركاء والأطفال والمهن الإحترافيه.",
        "مشاكل في احترام الذات، قيم غير متسقة، مشاكل في الحفاظ على العلاقات الوثيقة، صعوبة في التعاطف، مشكلة في الحدود، أساليب تربية إشكالية، صعوبة في تنظيم العواطف، مشاكل في التوتر، انخفاض الوعي الذاتي، صعوبة في العمل",
        "الخوف من الهجر، نمط العلاقات غير المستقرة، الشعور غير المستقر بالذات، السلوكيات الاندفاعية، السلوك الانتحاري أو إيذاء النفس، التغيرات المتكررة والمكثفة في العواطف، مشاعر الفراغ المزمنة، ردود فعل الغضب الشديدة، الانفصال."
      ]
    },
    {
      "tag": "ar-treatment",
      "patterns": [
        "ما هو علاج الإضطراب الشخصي؟",
        "ما هي الطرق للتغلب علي الإضطراب الشخصي؟",
        "كيف يمكن علاج الإضطراب الشخصي؟",
        "في رأيك ما الذي يجب أن أقوم به للتغلب علي الإضطراب الشخصي؟"
      ],
      "responses": [
        "العلاج السلوكي الجدلي، وهو شكل من أشكال العلاج النفسي المعروف أيضًا باسم العلاج بالكلام، هو الطريقة الرئيسية لعلاج اضطرابات الشخصية. يمكن أيضًا استخدام الأدوية أثناء العلاج.",
        "يعتمد العلاج الأفضل بالنسبة لك على اضطراب شخصيتك ومدى خطورته ووضعك الحياتي. في كثير من الأحيان، هناك حاجة إلى نهج الفريق لتلبية احتياجاتك العقلية والطبية والاجتماعية. قد تحتاج إلى العلاج لعدة أشهر أو سنوات.",
        "لم توافق إدارة الغذاء والدواء (FDA) على أي أدوية لعلاج اضطرابات الشخصية على وجه التحديد. لكن هناك عدة أنواع من الأدوية النفسية قد تساعد في علاج أعراض اضطراب الشخصية.",
        "في بعض الحالات، قد يكون اضطراب الشخصية خطيرًا جدًا لدرجة أنك تحتاج إلى البقاء في المستشفى للحصول على رعاية الصحة العقلية. يوصى بهذا بشكل عام فقط عندما لا تتمكن من رعاية نفسك بشكل صحيح أو عندما تكون في خطر مباشر لإيذاء نفسك أو شخص آخر. بعد أن تستقر حالتك في المستشفى، قد يوصي أخصائي الصحة العقلية الخاص بك ببرنامج مستشفى نهاري، أو برنامج سكني، أو علاج في العيادات الخارجية."
      ]
    },
    {
      "tag": "ar-dangers",
      "patterns": [
        "هل تعتقد أن الإضراب الشخصي خطير؟",
        "لماذا تعتقد أن الإضطراب الشخصي خطير؟",
        "كيف يمكن للإضطراب الشخصي أن يكون خطير؟",
        "في رأيك ما هي مخاطر الإضطراب الشخصي؟"
      ],
      "responses": [
        "غالبًا ما يواجه الأشخاص الذين يعانون من اضطرابات الشخصية صعوبة في فهم العواطف وتحمل الضيق. وهم يتصرفون باندفاع. وهذا يجعل من الصعب عليهم التواصل مع الآخرين، مما يسبب مشكلات خطيرة، ويؤثر على حياتهم الأسرية، وأنشطتهم الاجتماعية، وأدائهم في العمل والمدرسة، ونوعية حياتهم بشكل عام.",
        "تظهر الأبحاث الحديثة أن نوع الجريمة المرتكبة، سواء كانت جنسية أو غير جنسية، يمكن ربطه بنوع اضطراب الشخصية الذي يعاني منه الجاني، مثل اضطراب الشخصية المعادية للمجتمع واضطراب الشخصية الحدية.",
        "يجعل اضطراب الشخصية الحدية الأشخاص أكثر عرضة للانخراط في سلوكيات متهورة أو محفوفة بالمخاطر مثل: السرعة أو غيرها من القيادة غير الآمنة.الأكل بشراهه أيضا.",
        "هناك نوعان من اضطرابات الشخصية الشائعة بين القتلة المتسلسلين هما اضطراب الشخصية المعادية للمجتمع (الذي يتضمن الاعتلال النفسي) (APD) واضطراب الشخصية الحدية (BPD) وكلاهما ممثلان بشكل زائد في نظام السجون، بالمقارنة مع عامة السكان."
      ]
    },
    {
      "tag": "ar-doc-help?",
      "patterns": [
        "هل يجب علي زيارة طبيب إذا كان لدي شك أنني مريض بالإضطراب الشخصي؟",
        "هل تعتقد أنه يجب رؤية طبيب إذا كنت أعتقد أنني مصاب بالإضطراب النفسي؟",
        "في رأيك هل يجب البحث عن طبيب إذا ظهرت أي علامه من علامات الإضطراب الشخصي؟"
      ],
      "responses": [
        "إذا كنت تعاني أنت أو أي شخص تعرفه من علامات اضطراب الشخصية التي تسبب له الضيق، فمن المفيد رؤية الطبيب. من الصعب التعامل مع اضطراب الشخصية بمفردك. إن التحدث إلى الطبيب أو أخصائي الصحة العقلية هو الخطوة الأولى نحو الحصول على الدعم والعلاج",
        "يتم تشخيص اضطرابات الشخصية، بما في ذلك اضطراب الشخصية الحدية، بناءً على: مقابلة تفصيلية مع طبيبك أو مقدم خدمات الصحة العقلية. التقييم النفسي الذي قد يشمل استكمال الاستبيانات. التاريخ الطبي والفحص",
        "قد يحيلك طبيبك إلى أخصائي الصحة العقلية. يتضمن هذا التقييم مناقشة حول أفكارك ومشاعرك وسلوكك، وقد يتضمن استبيانًا للمساعدة في تحديد التشخيص. بعد إذنك، قد تكون المعلومات الواردة من أفراد العائلة أو غيرهم مفيدة.",
        "قد يقوم طبيبك بإجراء فحص بدني ويطرح أسئلة حول صحتك. في بعض الحالات، قد يربط طبيبك أعراضك بمخاوف صحية جسدية أساسية. قد يشمل تقييمك اختبارات معملية واختبار فحص الكحول والمخدرات."
      ]
    },
    {
      "tag": "ar-sport-help?",
      "patterns": [
        "هل تساعد الرياضه في التعامل مع إضطراب الشخصيه؟",
        "هل تعتقد أن الرياضه مهمه للتغلب علي إضطراب الشخصيه؟",
        "من وجهة نظرك هل للرياضه دور في التعامل مع إضطراب الشخصيه؟"
      ],
      "responses": [
        " (BPD) يمكن أن يساعد تحريك جسمك في تخفيف أعراض اضطراب الشخصية الحدية والاكتئاب والقلق واضطرابات الصحة العقلية الأخرى.",
        "الرياضه. يقترح التحالف الوطني للأمراض العقلية (NAMI) أن تناول نظام غذائي متوازن وممارسة الرياضة قد يكون مفيدًا لشخص مصاب باضطراب الشخصية الحدية. وجد التحليل التلوي من عام 2022 أن 30 دقيقة على الأقل من التمارين البدنية يمكن أن تساعد في تحسين قدرة الشخص على تنظيم عواطفه.",
        "إذا كنت تواجه مشكلة في التعامل مع اضطراب الشخصية الحدية، فقد يساعدك النشاط البدني على استعادة السيطرة على عواطفك وتحقيق استقرار نفسك. قد تكون الأنشطة مثل الملاكمة أو الجري أو ركوب الدراجات أو اليوجا مفيدة.",
        "قد تكون التمارين البدنية جزءًا مفيدًا من نهج العلاج للأشخاص الذين يعانون من اضطراب الشخصية الحدية، حيث تشير الأبحاث إلى أن السمنة بين الأشخاص المصابين باضطراب الشخصية الحدية تزداد بمرور الوقت، مما يؤدي إلى تفاقم خطر الإصابة بالحالات الطبية المزمنة المرتبطة بالسمنة."
      ]
    },
    {
      "tag": "ar-death",
      "patterns": [
        "ماتت أمي",
        "توفي أخي",
        "توفي أبي",
        "ماتت أختي",
        "مات أحد أفراد عائلتي",
        "توفي صديقي"
      ],
      "responses": [
        "انا اسف لسماع ذلك. إذا كنت تريد التحدث عن ذلك. أنا هنا.",
        "أنا آسف حقا لسماع ذلك. أنا هنا لمساعدتك في التغلب على الحزن والقلق وأي شيء آخر قد تشعر به في هذا الوقت.",
        "تعازي. أنا هنا إذا كنت بحاجة إلى التحدث."
      ]
    },
    {
      "tag": "ar-suicide",
      "patterns": [
        "أريد قتل نفسي",
        "لقد فكرت في قتل نفسي",
        "أريد الموت",
        "سأقوم بقتل نفسي",
        "سوف أقوم بارتكاب جريمة انتحار"
      ],
      "responses": ["أنا آسف جدًا لسماع ذلك ولكن لديك الكثير لتتطلع إليه."]
    }
  ]
}
