{
  "intents": [
    {
      "tag": "scared",
      "patterns": [
        "I'm scared",
        "That sounds awful. What do i do?",
        "No i don't want to feel this way",
        "I am scared for myself"
      ],
      "responses": [
        "It's only natural to feel this way. I'm here for you.",
        "It'll all be okay. This feeling is only momentary.",
        "I understand how you feel. Don't put yourself down because of it."
      ]
    },
    {
      "tag": "ar-scared",
      "patterns": [
        "أنا خائف",
        "هذا يبدو فظيعا. ماذا أفعل؟",
        "لا، لا أريد أن أشعر بهذه الطريقة",
        "نا خائف على نفسي"
      ],
      "responses": [
        "من الطبيعي أن تشعر بهذه الطريقة. أنا هنا من أجلك.",
        "سيكون كل شيء على ما يرام. هذا الشعور هو لحظة فقط.",
        "أنا أفهم شعورك. لا تحبط نفسك بسبب ذلك."
      ]
    },
    {
      "tag": "fact-1",
      "patterns": [
        "What is Phobia?",
        "Define Phobia",
        "What is Extreme fear?",
        "Why can't I deal with people?"
      ],
      "responses": [
        "Phobia is an intense and irrational fear of a specific object, situation, or activity",
        "It is a type of anxiety disorder and can cause significant distress and impairment in daily life.",
        "Phobias can develop from a variety of factors, including genetics, traumatic experiences, and learned behavior.",
        "There are many different types of phobias, including specific phobias (such as fear of spiders or heights), social phobias (fear of social situations), and agoraphobia (fear of being in situations where escape might be difficult).",
        "Phobias can vary in severity, with some people experiencing mild anxiety when confronted with their fear and others experiencing extreme panic attacks."
      ]
    },
    {
      "tag": "ar-fact-1",
      "patterns": [
        "ما هي الفوبيا؟",
        "تعريف الفوبيا؟",
        "ما هو الخوف الشديد؟",
        "لماذا لا أستطيع التعامل مع الناس؟"
      ],
      "responses": [
        "الرهاب هو خوف شديد وغير عقلاني من شيء أو موقف أو نشاط معين",
        " نوع من اضطراب القلق ويمكن أن يسبب ضائقة كبيرة وضعفًا في الحياة اليومية.",
        "يمكن أن يتطور الرهاب من مجموعة متنوعة من العوامل، بما في ذلك الوراثة والتجارب المؤلمة والسلوك المكتسب.",
        "هناك العديد من أنواع الرهاب المختلفة، بما في ذلك الرهاب المحدد (مثل الخوف من العناكب أو المرتفعات)، والرهاب الاجتماعي (الخوف من المواقف الاجتماعية)، ورهاب الخلاء (الخوف من التواجد في مواقف قد يكون من الصعب الهروب منها).",
        "يمكن أن تختلف حالات الرهاب في شدتها، حيث يعاني بعض الأشخاص من قلق خفيف عند مواجهة خوفهم بينما يعاني آخرون من نوبات هلع شديدة."
      ]
    },
    {
      "tag": "fact-2",
      "patterns": [
        "How do I know I have a phobia?",
        "What are the symptoms of phobia?",
        "Is panic a phobia?",
        "Is fear a phobia?"
      ],
      "responses": [
        "Intense and irrational fear of a specific object, situation, or activity",
        "Avoidance of the feared object or situation",
        "Physical symptoms such as rapid heartbeat, trembling, sweating, and shortness of breath when exposed to the phobia",
        "Feeling of panic or dread when confronted with the phobia",
        "Difficulty functioning in everyday life due to the phobia",
        "Persistent thoughts about the phobia and its potential impact on your life"
      ]
    },
    {
      "tag": "ar-fact-2",
      "patterns": [
        "كيف يمكنني التعرف على الفوبيا؟",
        "ما هي اعراض الفوبيا؟",
        "هل الهلع فوبيا؟",
        "الخوف من الفوبيا؟",
        "الرهاب"
      ],
      "responses": [
        "الخوف الشديد وغير العقلاني من شيء أو موقف أو نشاط معين",
        "تجنب الشيء أو الموقف الذي يخيفك",
        "أعراض جسدية مثل سرعة ضربات القلب والارتعاش والتعرق وضيق التنفس عند التعرض للرهاب",
        "الشعور بالذعر أو الرهبة عند مواجهة الرهاب",
        "صعوبة العمل في الحياة اليومية بسبب الرهاب",
        "أفكار مستمرة حول الرهاب وتأثيره المحتمل على حياتك"
      ]
    },
    {
      "tag": "fact-3",
      "patterns": [
        "Will phobia affect my life?",
        "What are the dangers of phobia?",
        "Is phobia dangerous?",
        "does phobia affect health?"
      ],
      "responses": [
        "Phobias can be dangerous in that they can significantly impair a person's daily life and cause distress.",
        "Phobias can be dangerous in that someone with a fear of flying may avoid traveling or miss out on important events because of their phobia",
        "Phobias can be dangerous in that  In extreme cases, phobias can lead to panic attacks, which can be physically and emotionally distressing."
      ]
    },
    {
      "tag": "ar-fact-3",
      "patterns": [
        "هل الفوبيا ستؤثر على حياتي؟",
        "ما هي مخاطر الفوبيا؟",
        "هل الفوبيا خطر؟",
        "هل ستؤثر الفوبيا على الصحة؟"
      ],
      "responses": [
        "يمكن أن يكون الرهاب خطيرًا لأنه يمكن أن يضعف الحياة اليومية للشخص بشكل كبير ويسبب له الضيق.",
        "يمكن أن يكون الرهاب خطيرًا لأن الشخص الذي يخاف من الطيران قد يتجنب السفر أو يفوت أحداثًا مهمة بسبب رهابه.",
        "يمكن أن يكون الرهاب خطيرًا لأنه في الحالات القصوى، يمكن أن يؤدي الرهاب إلى نوبات هلع، والتي يمكن أن تكون مؤلمة جسديًا وعاطفيًا."
      ]
    },
    {
      "tag": "fact-4",
      "patterns": [
        "What is the treatment for phobia?",
        "How can I overcome phobia?",
        "How can I get rid of phobia?",
        "How do I save myself from phobia?",
        "Will sports help me overcome my phobia?",
        "I can use sports against phobia?"
      ],
      "responses": [
        "Treatment for phobias often involves therapy, such as cognitive-behavioral therapy, which helps individuals confront and manage their fears.",
        "Medications may be prescribed to help manage anxiety symptoms. With proper treatment, many people are able to overcome their phobias and live fulfilling lives.",
        "Sports play a role, Engaging in regular physical activity through sports can help reduce stress and anxiety, which can in turn help manage phobias.",
        "Overcoming challenges and achieving goals in sports can boost self-confidence and resilience, which can be beneficial for managing phobias Seeking professional help, such as therapy or counseling, is also important for effectively managing and overcoming phobias."
      ]
    },
    {
      "tag": "ar-fact-4",
      "patterns": [
        "ما هو علاج الفوبيا؟",
        "كيف يمكنني التغلب على الفوبيا؟",
        "كيف يمكنني التخلص من الفوبيا؟",
        "كيف أحفظ نفسي من الفوبيا؟",
        "هل الرياضة ستساعدني في التغلب على الفوبيا؟",
        "هل يمكنني الاستعانة بالرياضة ضد الفوبيا؟"
      ],
      "responses": [
        "غالبًا ما يتضمن علاج الرهاب العلاج، مثل العلاج السلوكي المعرفي، الذي يساعد الأفراد على مواجهة مخاوفهم وإدارتها.",
        "يمكن وصف الأدوية للمساعدة في إدارة أعراض القلق. مع العلاج المناسب، يستطيع العديد من الأشخاص التغلب على رهابهم والعيش حياة مُرضية.",
        "تلعب الرياضة دورًا، حيث يمكن أن يساعد الانخراط في نشاط بدني منتظم من خلال الرياضة في تقليل التوتر والقلق، مما قد يساعد بدوره في إدارة الرهاب.",
        "التغلب على التحديات وتحقيق الأهداف في الرياضة يمكن أن يعزز الثقة بالنفس والمرونة، الأمر الذي يمكن أن يكون مفيدًا لإدارة الرهاب. إن طلب المساعدة المهنية، مثل العلاج أو الاستشارة، مهم أيضًا لإدارة الرهاب والتغلب عليه بشكل فعال."
      ]
    },
    {
      "tag": "fact-5",
      "patterns": [
        "Do I need a doctor to overcome my phobia?",
        "Will the doctor help me against phobia?",
        "When do I go to the doctor when I suffer from phobia?"
      ],
      "responses": [
        "If you are struggling with a phobia and it is significantly impacting your daily life, it is important to seek help from a mental health professional.",
        "A doctor or therapist can work with you to develop a treatment plan that may include therapy, medication, or other interventions to help you manage and overcome your phobia.",
        "It is important to address your fears and seek support from your doctor in order to improve your quality of life and prevent your phobia from getting worse over time."
      ]
    },
    {
      "tag": "ar-fact-5",
      "patterns": [
        "هل سأحتاج الدكتور للتغلب على الفوبيا؟",
        "هل الدكتور سيساعدني ضد الفوبيا",
        "في أي مرحلة من الفوبيا متى أذهب للطبيب؟"
      ],
      "responses": [
        "إذا كنت تعاني من الرهاب ويؤثر بشكل كبير على حياتك اليومية، فمن المهم طلب المساعدة من أخصائي الصحة العقلية.",
        "يمكن للطبيب أو المعالج أن يعمل معك لوضع خطة علاجية قد تشمل العلاج أو الأدوية أو غيرها من التدخلات لمساعدتك على إدارة الرهاب لديك والتغلب عليه.",
        "من المهم معالجة مخاوفك وطلب الدعم من طبيبك من أجل تحسين نوعية حياتك ومنع تفاقم رهابك بمرور الوقت."
      ]
    }
  ]
}
